[
    {
        "title": "Terraform Labs to Open Claims Portal for Investors on March 31",
        "link": "https://www.coindesk.com/markets/2025/03/29/terraform-labs-to-open-claims-portal-for-investors-on-march-31",
        "published": "Sat, 29 Mar 2025 17:14:01 +0000",
        "summary": "Going over files with laptops (Scott Graham/Unsplash)",
        "content": "Terraform Labs, the firm behind the collapsed Luna token and the TerraUSD stablecoin, will open a portal on March 31 to allow investors to file claims for crypto losses tied to the company’s downfall and subsequent bankruptcy. The online system, operated by claims administrator Kroll, is part of the company's court-supervised wind-down process. Investors have until April 30 at 11:59 p.m. ET to submit claims through claims.terra.money. Late submissions will not be considered, meaning those who miss the deadline forfeit their right to any recovery, according to a Medium post. Eligible claims must be tied to specific cryptocurrencies listed in the case documents and held during the period surrounding the Terra ecosystem's collapse. Notably, assets with less than $100 in on-chain liquidity and certain others—like Terra 2.0's Luna—will not qualify. Claimants must also submit proof of ownership. The preferred method is read-only API keys from exchanges, which the administrator considers more reliable than screenshots or manually uploaded documents. The post adds that those using manual evidence may face extended review periods or risk their claims being denied altogether. Once filed, claims will be reviewed and verified. Initial decisions will be shared within 90 days after the deadline and approved claims will be eligible for pro rata distributions once processing concludes. The Terra ecosystem collapsed in 2022, leading to the largest destruction of wealth in just three days in the cryptocurrency space’s history. LUNA’s market capitalization plunged from over $41 billion to $6 million in that period.Read more: Terraform Labs, Do Kwon Agree to Pay SEC a Combined $4.5B in Civil Fraud Case Francisco is a reporter for CoinDesk with a passion for cryptocurrencies and personal finance. Before joining CoinDesk he worked at major financial and crypto publications. He owns bitcoin, ether, solana, and PAXG above CoinDesk's $1,000 disclosure threshold. About Contact",
        "analysis": {
            "entities": [
                [
                    "Terraform Labs",
                    "PERSON"
                ],
                [
                    "Luna",
                    "CRYPTO"
                ],
                [
                    "TerraUSD",
                    "ORG"
                ],
                [
                    "March 31",
                    "DATE"
                ],
                [
                    "Kroll",
                    "PERSON"
                ],
                [
                    "April 30",
                    "DATE"
                ],
                [
                    "11:59 p.m.",
                    "TIME"
                ],
                [
                    "Terra",
                    "CRYPTO"
                ],
                [
                    "less than $100",
                    "MONEY"
                ],
                [
                    "Terra 2.0's",
                    "LAW"
                ],
                [
                    "API",
                    "ORG"
                ],
                [
                    "90 days",
                    "DATE"
                ],
                [
                    "2022",
                    "DATE"
                ],
                [
                    "just three days",
                    "DATE"
                ],
                [
                    "LUNA",
                    "ORG"
                ],
                [
                    "over $41 billion to $6 million",
                    "MONEY"
                ],
                [
                    "SEC",
                    "ORG"
                ],
                [
                    "Combined",
                    "ORG"
                ],
                [
                    "4.5B",
                    "MONEY"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "solana",
                    "PERSON"
                ],
                [
                    "1,000",
                    "MONEY"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.079,
                    "neu": 0.86,
                    "pos": 0.061,
                    "compound": -0.7184
                },
                "label": "negative"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9998537302017212
                },
                {
                    "label": "neutral",
                    "score": 0.9998575448989868
                },
                {
                    "label": "negative",
                    "score": 0.9335773587226868
                },
                {
                    "label": "neutral",
                    "score": 0.9999312162399292
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Luna": {
                    "sentiment": "neutral",
                    "confidence": 0.8679,
                    "mentions": 2
                },
                "Terra": {
                    "sentiment": "neutral",
                    "confidence": 0.9281,
                    "mentions": 5
                }
            },
            "crypto_scores": {
                "Terra": 0.6856,
                "Luna": 0.3736
            },
            "topics": [
                [
                    "case",
                    "collapsed",
                    "submit",
                    "terraform",
                    "tied",
                    "read",
                    "coindesk",
                    "luna",
                    "terra",
                    "claims"
                ]
            ],
            "top_keywords_tfidf": [
                "claims",
                "terra",
                "luna"
            ]
        },
        "timestamp": "2025-03-29T21:07:56.131766+00:00"
    },
    {
        "title": "Bitcoin Miner MARA Starts Massive $2B Stock Sale Plan to Buy More BTC",
        "link": "https://www.coindesk.com/markets/2025/03/29/bitcoin-miner-mara-starts-massive-usd2b-at-the-market-stock-sale-plan-to-buy-more-btc",
        "published": "Sat, 29 Mar 2025 17:02:04 +0000",
        "summary": "Marathon Digital CEO Fred Thiel (CoinDesk \"First Mover\" screenshot)",
        "content": "Bitcoin mining company MARA Holdings (MARA) is launching a fresh $2 billion stock offering to buy more bitcoin, continuing its plan of buying BTC in the open market through capital raise while sticking to its \"Hodl\" strategy.  According to a Form 8-K  and a new prospectus filed with the U.S. Securities and Exchange Commission (SEC), MARA entered into an at-the-market (ATM) equity program with a group of investment banks including Barclays, BMO Capital Markets, BTIG, Cantor Fitzgerald, and others. The proceeds of the offering, which will see brokers selling shares of the miner from time to time, will be used mainly for the acquisition of bitcoin in the open market.  \"We currently intend to use the net proceeds from this offering for general corporate purposes, including the acquisition of bitcoin and for working capital,\" MARA said in its prospectus.  This new fresh stock sales plan follows a previous ATM offering that targeted up to $1.5 billion for the miner.   MARA has adopted Michael Saylor's strategy of raising funds through equity and convertible bond offerings and buying bitcoin in the open market. The miner now holds 46,376 BTC in its treasury, making it the second-largest bitcoin stash among publicly traded companies, behind Strategy’s 506,137 BTC. The plan to buy bitcoin in the open market was adopted by the miner last year, even though a miner can theoretically mine bitcoin at a discount to the spot price. The industry became challenging after last year's halving cut mining rewards by half, squeezing profit margins on the back of rising costs. This made buying bitcoin in the open market, alongside mining, a relatively better strategy for the miners. Read more: Bitcoin Mining Is So Rough a Miner Adopted Michael Saylor's Successful BTC Strategy Francisco is a reporter for CoinDesk with a passion for cryptocurrencies and personal finance. Before joining CoinDesk he worked at major financial and crypto publications. He owns bitcoin, ether, solana, and PAXG above CoinDesk's $1,000 disclosure threshold. About Contact",
        "analysis": {
            "entities": [
                [
                    "MARA Holdings",
                    "ORG"
                ],
                [
                    "$2 billion",
                    "MONEY"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "the U.S. Securities and Exchange Commission",
                    "ORG"
                ],
                [
                    "SEC",
                    "ORG"
                ],
                [
                    "ATM",
                    "ORG"
                ],
                [
                    "Barclays",
                    "ORG"
                ],
                [
                    "BMO Capital Markets",
                    "ORG"
                ],
                [
                    "Cantor Fitzgerald",
                    "PERSON"
                ],
                [
                    "up to $1.5 billion",
                    "MONEY"
                ],
                [
                    "Michael Saylor's",
                    "PERSON"
                ],
                [
                    "46,376",
                    "CARDINAL"
                ],
                [
                    "second",
                    "ORDINAL"
                ],
                [
                    "506,137",
                    "CARDINAL"
                ],
                [
                    "last year",
                    "DATE"
                ],
                [
                    "last year's",
                    "DATE"
                ],
                [
                    "half",
                    "CARDINAL"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "solana",
                    "PERSON"
                ],
                [
                    "1,000",
                    "MONEY"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.006,
                    "neu": 0.91,
                    "pos": 0.084,
                    "compound": 0.9719
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9999279975891113
                },
                {
                    "label": "neutral",
                    "score": 0.9997358918190002
                },
                {
                    "label": "negative",
                    "score": 0.9999405145645142
                },
                {
                    "label": "positive",
                    "score": 0.9962306618690491
                },
                {
                    "label": "neutral",
                    "score": 0.9999837875366211
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {},
            "crypto_scores": {},
            "topics": [
                [
                    "coindesk",
                    "btc",
                    "mining",
                    "offering",
                    "open",
                    "mara",
                    "strategy",
                    "miner",
                    "market",
                    "bitcoin"
                ]
            ],
            "top_keywords_tfidf": [
                "bitcoin",
                "market",
                "miner"
            ]
        },
        "timestamp": "2025-03-29T21:07:56.846473+00:00"
    },
    {
        "title": "FTX to Begin $11.4B Creditor Payouts in May After Years-Long Bankruptcy Battle",
        "link": "https://www.coindesk.com/markets/2025/03/29/ftx-to-begin-usd11-4b-creditor-payouts-in-may-after-years-long-bankruptcy-battle",
        "published": "Sat, 29 Mar 2025 15:01:17 +0000",
        "summary": "FTX looks poised to recover a surprisingly high amount for creditors, a year after Sam Bankman-Fried was undone by a CoinDesk scoop (Adobe Firefly)",
        "content": "FTX, the collapsed cryptocurrency exchange once helmed by Sam Bankman-Fried, plans to begin paying its main creditors at the end of May, Bloomberg reported based on court proceedings in Delaware this week. The company has gathered $11.4 billion in cash to distribute to thousands of parties affected by its 2022 bankruptcy, with the first payments to major creditors set for May 30. These include institutional investors and firms that held crypto on FTX’s platform. Smaller creditors with claims below the $50,000 mark have already begun receiving distributions. FTX’s collapse left a financial crater and a trail of frustrated creditors—many of whom expected to be repaid in crypto, not dollars. Since the bankruptcy, the price of bitcoin has more than quadrupled, intensifying frustrations among those waiting for their assets back. The task of unwinding FTX’s balance sheet has been slowed by a large number of claims, many of them reportedly questionable. Andrew Dietderich, a bankruptcy attorney for the firm, told the court that FTX has received “27 quintillion” claims, Blloomberg reported, many of which are duplicates or outright fraudulent. Interest payments are compounding the urgency. While FTX earns only a modest return on its cash, legitimate creditors are entitled to 9% interest annually on unpaid claims. The longer it takes to pay, the more the company could owe. Read more: Nearly All FTX Creditors Will Get 118% of Their Funds Back in Cash, Estate Says in New Plan Francisco is a reporter for CoinDesk with a passion for cryptocurrencies and personal finance. Before joining CoinDesk he worked at major financial and crypto publications. He owns bitcoin, ether, solana, and PAXG above CoinDesk's $1,000 disclosure threshold. About Contact",
        "analysis": {
            "entities": [
                [
                    "FTX",
                    "ORG"
                ],
                [
                    "Sam Bankman-Fried",
                    "PERSON"
                ],
                [
                    "the end of May",
                    "DATE"
                ],
                [
                    "Bloomberg",
                    "GPE"
                ],
                [
                    "Delaware",
                    "GPE"
                ],
                [
                    "this week",
                    "DATE"
                ],
                [
                    "$11.4 billion",
                    "MONEY"
                ],
                [
                    "thousands",
                    "CARDINAL"
                ],
                [
                    "2022",
                    "DATE"
                ],
                [
                    "first",
                    "ORDINAL"
                ],
                [
                    "May 30",
                    "DATE"
                ],
                [
                    "50,000",
                    "MONEY"
                ],
                [
                    "Andrew Dietderich",
                    "PERSON"
                ],
                [
                    "27",
                    "CARDINAL"
                ],
                [
                    "Blloomberg",
                    "GPE"
                ],
                [
                    "9%",
                    "PERCENT"
                ],
                [
                    "annually",
                    "DATE"
                ],
                [
                    "118%",
                    "PERCENT"
                ],
                [
                    "Their Funds Back",
                    "ORG"
                ],
                [
                    "New Plan Francisco",
                    "EVENT"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "solana",
                    "PERSON"
                ],
                [
                    "1,000",
                    "MONEY"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.069,
                    "neu": 0.873,
                    "pos": 0.058,
                    "compound": -0.5106
                },
                "label": "negative"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9971792697906494
                },
                {
                    "label": "negative",
                    "score": 0.9999858140945435
                },
                {
                    "label": "neutral",
                    "score": 0.999667763710022
                },
                {
                    "label": "neutral",
                    "score": 0.9999806880950928
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {},
            "crypto_scores": {},
            "topics": [
                [
                    "payments",
                    "reported",
                    "financial",
                    "coindesk",
                    "bankruptcy",
                    "cash",
                    "crypto",
                    "claims",
                    "creditors",
                    "ftx"
                ]
            ],
            "top_keywords_tfidf": [
                "ftx",
                "creditors",
                "claims"
            ]
        },
        "timestamp": "2025-03-29T21:07:57.528560+00:00"
    },
    {
        "title": "Why Is the Crypto Market Down Today? Bitcoin Drops to $82K as Traders Flee Risk Assets Amid Macro Worries",
        "link": "https://www.coindesk.com/markets/2025/03/29/why-is-the-crypto-market-down-today-bitcoin-drops-to-usd82k-as-traders-flee-risk-assets-amid-macro-worries",
        "published": "Sat, 29 Mar 2025 13:51:25 +0000",
        "summary": "Stock market price charts (Anne Nygård/Unsplash)",
        "content": "Cryptocurrency prices have experienced a sharp decline over the last few hours, with bitcoin (BTC) now being down around 3% over the last 24 hours, while major altcoins including XRP, BNB, and SOL are down between 4% and 5% over the same period. The broader cryptocurrency market, represented by the CoinDesk 20 Index (CD20), lost around 3.3% of its value over the period. The sharp drop brings BTC’s performance down 1.7% for the week, while CD20 is down nearly 5%. Over the last 24 hours, over $300 million worth of long positions were liquidated on centralized cryptocurrency exchanges, while $38.8 million worth of shorts were liquidated on these platforms, according to CoinGlass data. The drop appears to be part of a wider derisking move among traders, as investors are anticipating the impact of President Donald Trump’s reciprocal tariffs that are set to come into effect on April 2. The move heightened after core Personal Consumption Expenditures (PCE) data came in hotter than expected on Friday. Just this week, consumer confidence data dipped further than expected, while the index for future expectations came in at a 12-year low, and well below levels associated with an incoming recession. This confluence of factors has seen investors reduce their exposure to risk assets and triggered a flight to safety. CoinDesk Data’s latest stablecoin report shows that gold-backed cryptocurrencies have benefitted from the risk-off move, as their market capitalization climbed above $1.4 billion in March. Gold-backed cryptocurrencies are, in fact, countering the market’s bearish trend. While the CD20 is down over 3% in the last 24-hour period, tokens including PAXG and XAUT are up 0.7% to over $3,100. These tokens are up more than 18% year-to-date, while BTC is down 12.5% and the CD20 index 28% so far this year. Francisco is a reporter for CoinDesk with a passion for cryptocurrencies and personal finance. Before joining CoinDesk he worked at major financial and crypto publications. He owns bitcoin, ether, solana, and PAXG above CoinDesk's $1,000 disclosure threshold. About Contact",
        "analysis": {
            "entities": [
                [
                    "the last few hours",
                    "TIME"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "around 3%",
                    "PERCENT"
                ],
                [
                    "the last 24 hours",
                    "TIME"
                ],
                [
                    "XRP",
                    "ORG"
                ],
                [
                    "BNB",
                    "ORG"
                ],
                [
                    "SOL",
                    "ORG"
                ],
                [
                    "between 4% and 5%",
                    "PERCENT"
                ],
                [
                    "the same period",
                    "DATE"
                ],
                [
                    "the CoinDesk 20 Index",
                    "ORG"
                ],
                [
                    "around 3.3%",
                    "PERCENT"
                ],
                [
                    "1.7%",
                    "PERCENT"
                ],
                [
                    "the week",
                    "DATE"
                ],
                [
                    "nearly 5%",
                    "PERCENT"
                ],
                [
                    "$300 million",
                    "MONEY"
                ],
                [
                    "$38.8 million",
                    "MONEY"
                ],
                [
                    "CoinGlass",
                    "ORG"
                ],
                [
                    "Donald Trump",
                    "PERSON"
                ],
                [
                    "April 2",
                    "DATE"
                ],
                [
                    "Personal Consumption Expenditures",
                    "ORG"
                ],
                [
                    "PCE",
                    "ORG"
                ],
                [
                    "Friday",
                    "DATE"
                ],
                [
                    "Just this week",
                    "DATE"
                ],
                [
                    "12-year",
                    "DATE"
                ],
                [
                    "$1.4 billion",
                    "MONEY"
                ],
                [
                    "March",
                    "DATE"
                ],
                [
                    "over 3%",
                    "PERCENT"
                ],
                [
                    "the last",
                    "DATE"
                ],
                [
                    "24-hour",
                    "TIME"
                ],
                [
                    "PAXG",
                    "ORG"
                ],
                [
                    "XAUT",
                    "ORG"
                ],
                [
                    "0.7%",
                    "PERCENT"
                ],
                [
                    "over $3,100",
                    "MONEY"
                ],
                [
                    "more than 18%",
                    "PERCENT"
                ],
                [
                    "12.5%",
                    "PERCENT"
                ],
                [
                    "28%",
                    "PERCENT"
                ],
                [
                    "this year",
                    "DATE"
                ],
                [
                    "Francisco",
                    "PERSON"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "solana",
                    "PERSON"
                ],
                [
                    "1,000",
                    "MONEY"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.039,
                    "neu": 0.899,
                    "pos": 0.063,
                    "compound": 0.8074
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "negative",
                    "score": 0.9999778270721436
                },
                {
                    "label": "negative",
                    "score": 0.999618411064148
                },
                {
                    "label": "positive",
                    "score": 0.9906778335571289
                },
                {
                    "label": "positive",
                    "score": 0.4179556369781494
                },
                {
                    "label": "neutral",
                    "score": 0.999996542930603
                }
            ],
            "bert_sentiment_summary": "negative",
            "entity_sentiment": {},
            "crypto_scores": {},
            "topics": [
                [
                    "market",
                    "24",
                    "cryptocurrencies",
                    "btc",
                    "cryptocurrency",
                    "year",
                    "period",
                    "cd20",
                    "data",
                    "coindesk"
                ]
            ],
            "top_keywords_tfidf": [
                "coindesk",
                "data",
                "cd20"
            ]
        },
        "timestamp": "2025-03-29T21:07:58.374633+00:00"
    },
    {
        "title": "Where All the SEC Cases Are",
        "link": "https://www.coindesk.com/policy/2025/03/29/where-all-the-sec-cases-are",
        "published": "Sat, 29 Mar 2025 13:30:00 +0000",
        "summary": "The status of every SEC crypto case, minus Haliey Welch's. (Jesse Hamilton/CoinDesk)",
        "content": "The U.S. Securities and Exchange Commission has dropped or paused over a dozen ongoing cases (and lost one) since U.S. President Donald Trump retook office just over two months ago and appointed Commissioner Mark Uyeda as acting chair. You’re reading State of Crypto, a CoinDesk newsletter looking at the intersection of cryptocurrency and government. Click here to sign up for future editions. The U.S. Securities and Exchange Commission appears to have closed almost all of its outstanding crypto-related cases — at least the publicly disclosed ones — in the last two months since Mark Uyeda took over as acting chair of the agency. In many of the court filings, the SEC argued that it needs to pull these cases while the regulator's new crypto task force reassesses how exactly it applies securities laws to digital assets, though in at least some of these cases the SEC is leaving itself no recourse to sue again should it find some cryptos from previously active suits are indeed securities. TKTK Thursday If you’ve got thoughts or questions on what I should discuss next week or any other feedback you’d like to share, feel free to email me at nik@coindesk.com or find me on Bluesky @nikhileshde.bsky.social. You can also join the group conversation on Telegram. See ya’ll next week! Nikhilesh De is CoinDesk's managing editor for global policy and regulation, covering regulators, lawmakers and institutions. When he's not reporting on digital assets and policy, he can be found admiring Amtrak or building LEGO trains. He owns < $50 in BTC and < $20 in ETH. He was named the Association of Cryptocurrency Journalists and Researchers' Journalist of the Year in 2020. About Contact",
        "analysis": {
            "entities": [
                [
                    "The U.S. Securities and Exchange Commission",
                    "ORG"
                ],
                [
                    "over a dozen",
                    "CARDINAL"
                ],
                [
                    "one",
                    "CARDINAL"
                ],
                [
                    "U.S.",
                    "GPE"
                ],
                [
                    "Donald Trump",
                    "PERSON"
                ],
                [
                    "just over two months ago",
                    "DATE"
                ],
                [
                    "Mark Uyeda",
                    "PERSON"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "the last two months",
                    "DATE"
                ],
                [
                    "SEC",
                    "ORG"
                ],
                [
                    "Thursday",
                    "DATE"
                ],
                [
                    "next week",
                    "DATE"
                ],
                [
                    "nik@coindesk.com",
                    "ORG"
                ],
                [
                    "Bluesky",
                    "PERSON"
                ],
                [
                    "Telegram",
                    "ORG"
                ],
                [
                    "Amtrak",
                    "ORG"
                ],
                [
                    "LEGO",
                    "ORG"
                ],
                [
                    "50",
                    "MONEY"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "20",
                    "MONEY"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "the Association of Cryptocurrency Journalists",
                    "ORG"
                ],
                [
                    "2020",
                    "DATE"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.024,
                    "neu": 0.868,
                    "pos": 0.108,
                    "compound": 0.9682
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9995953440666199
                },
                {
                    "label": "neutral",
                    "score": 0.9892873764038086
                },
                {
                    "label": "neutral",
                    "score": 0.9998680353164673
                },
                {
                    "label": "neutral",
                    "score": 0.9999880790710449
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {},
            "crypto_scores": {},
            "topics": [
                [
                    "uyeda",
                    "mark",
                    "cryptocurrency",
                    "policy",
                    "months",
                    "sec",
                    "coindesk",
                    "crypto",
                    "cases",
                    "securities"
                ]
            ],
            "top_keywords_tfidf": [
                "securities",
                "cases",
                "crypto"
            ]
        },
        "timestamp": "2025-03-29T21:07:59.124286+00:00"
    },
    {
        "title": "Bitcoin Plunges Below $84K after $115B Sell-Off Wipes Out Weekly Gains",
        "link": "https://www.coindesk.com/markets/2025/03/28/bitcoin-plunges-below-usd84k-after-usd115b-sell-off-wipes-out-weekly-gains",
        "published": "Fri, 28 Mar 2025 21:08:30 +0000",
        "summary": "Bear (mana5280/Unsplash)",
        "content": "Hopes for the crypto recovery to continue vanished on Friday, as a market-wide rout erased virtually all gains from earlier this week. Bitcoin (BTC), hovering just below $88,000 a day ago, tumbled to $83,800 recently and is down 3.8% over the past 24 hours. The broad-market benchmark CoinDesk 20 Index declined 5.7%, with native cryptos Avalanche (AVAX), Polygon (POL), Near (NEAR), and Uniswap (UNI) all nursing almost 10% losses during the same period. Today's sell-off wiped out $115 billion of the total market value of cryptocurrencies, TradingView data shows. Ethereum's ether (ETH) declined over 6% to extend its downtrend against BTC, falling to its weakest relative price to the largest cryptocurrency since May 2020. Underscoring the bearish trend, spot ETH exchange-traded funds failed to attract any net inflows since early March, while their BTC counterparts saw over $1 billion of inflows in the past two weeks, according to Farside Investors data. The ugly crypto price action coincided with U.S. stocks selling off during the day on poor economic data, with the S&P 500 and the tech-heavy Nasdaq index down 2% and 2.8%, respectively. Crypto-focused stocks also suffered heavy losses: Strategy (MSTR), the largest corporate BTC holder, closed the day 10% lower, while crypto exchange Coinbase (COIN) dropped 7.7%. The February PCE inflation report, released this morning, showed a 2.5% year-over-year increase in the price index, with core inflation at 2.8%, slightly above expectations. Consumer spending showed a modest 0.4% rise, though inflation-adjusted figures indicate minimal growth, suggesting potential headwinds for economic growth. The Federal Reserve of Atlanta's GDPNow model now projects the U.S. economy to contract 2.8% in the first quarter, 0.5% adjusted for gold imports and exports, spurring stagflationary fears. The implementation of broad-scale U.S. tariffs next week—the so-called \"Liberation Day' on April 2, as the Trump administration refers to—also compounded investor concerns across markets. Bitcoin has closely correlated with the Nasdaq lately, so U.S. equities rolling over for another leg down could weigh on the broader crypto market. However, on a more optimistic note, today's decline could be BTC filling the price gap at around $84,000-$85,000 between Monday's open and the previous week's close on the Chicago Mercantile Exchange futures market. Historically, BTC usually revisited similar CME gaps and a drop to $84,000 was in the cards, CoinDesk senior analyst James Van Straten noted earlier this week. Read more: Bitcoin's Weekend Surge Forms Another CME Gap, Signaling Possible Drop Back \"At this stage it’s difficult to determine if we have already seen a bottom in 2025,\" Joel Kruger, market strategist at LMAX Group, said in a market note. Despite the on-going correction, he noted several positive trends such as crypto-friendly policies in the U.S. and more traditional financial firms entering the industry or expanding crypto offerings, which could bode well for digital assets later in the year. \"Any additional setbacks that we might see should be exceptionally well supported into the $70-75k area,\" he added. Krisztian Sandor is a U.S. markets reporter focusing on stablecoins, tokenization, real-world assets. He graduated from New York University's business and economic reporting program before joining CoinDesk. He holds BTC, SOL and ETH.\n About Contact",
        "analysis": {
            "entities": [
                [
                    "Friday",
                    "DATE"
                ],
                [
                    "earlier this week",
                    "DATE"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "just below $88,000",
                    "MONEY"
                ],
                [
                    "a day ago",
                    "DATE"
                ],
                [
                    "83,800",
                    "MONEY"
                ],
                [
                    "3.8%",
                    "PERCENT"
                ],
                [
                    "the past 24 hours",
                    "TIME"
                ],
                [
                    "CoinDesk 20 Index",
                    "PRODUCT"
                ],
                [
                    "5.7%",
                    "PERCENT"
                ],
                [
                    "Avalanche",
                    "CRYPTO"
                ],
                [
                    "Polygon",
                    "CRYPTO"
                ],
                [
                    "POL",
                    "ORG"
                ],
                [
                    "NEAR",
                    "ORG"
                ],
                [
                    "Uniswap",
                    "CRYPTO"
                ],
                [
                    "almost 10%",
                    "PERCENT"
                ],
                [
                    "Today",
                    "DATE"
                ],
                [
                    "$115 billion",
                    "MONEY"
                ],
                [
                    "TradingView",
                    "ORG"
                ],
                [
                    "Ethereum",
                    "CRYPTO"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "6%",
                    "PERCENT"
                ],
                [
                    "May 2020",
                    "DATE"
                ],
                [
                    "early March",
                    "DATE"
                ],
                [
                    "$1 billion",
                    "MONEY"
                ],
                [
                    "the past two weeks",
                    "DATE"
                ],
                [
                    "Farside Investors",
                    "ORG"
                ],
                [
                    "U.S.",
                    "GPE"
                ],
                [
                    "the day",
                    "DATE"
                ],
                [
                    "Nasdaq",
                    "ORG"
                ],
                [
                    "2%",
                    "PERCENT"
                ],
                [
                    "2.8%",
                    "PERCENT"
                ],
                [
                    "MSTR",
                    "ORG"
                ],
                [
                    "day",
                    "DATE"
                ],
                [
                    "10%",
                    "PERCENT"
                ],
                [
                    "Coinbase",
                    "PERSON"
                ],
                [
                    "COIN",
                    "ORG"
                ],
                [
                    "7.7%",
                    "PERCENT"
                ],
                [
                    "February",
                    "DATE"
                ],
                [
                    "this morning",
                    "TIME"
                ],
                [
                    "2.5%",
                    "PERCENT"
                ],
                [
                    "0.4%",
                    "PERCENT"
                ],
                [
                    "The Federal Reserve of",
                    "ORG"
                ],
                [
                    "Atlanta",
                    "GPE"
                ],
                [
                    "the first quarter",
                    "DATE"
                ],
                [
                    "0.5%",
                    "PERCENT"
                ],
                [
                    "next week",
                    "DATE"
                ],
                [
                    "Liberation Day'",
                    "WORK_OF_ART"
                ],
                [
                    "April 2",
                    "DATE"
                ],
                [
                    "Trump",
                    "CRYPTO"
                ],
                [
                    "today",
                    "DATE"
                ],
                [
                    "around $84,000-$85,000",
                    "MONEY"
                ],
                [
                    "Monday",
                    "DATE"
                ],
                [
                    "the previous week's",
                    "DATE"
                ],
                [
                    "the Chicago Mercantile Exchange",
                    "ORG"
                ],
                [
                    "CME",
                    "ORG"
                ],
                [
                    "84,000",
                    "MONEY"
                ],
                [
                    "James Van Straten",
                    "PERSON"
                ],
                [
                    "Bitcoin",
                    "CRYPTO"
                ],
                [
                    "2025",
                    "CRYPTO"
                ],
                [
                    "Joel Kruger",
                    "PERSON"
                ],
                [
                    "LMAX Group",
                    "ORG"
                ],
                [
                    "later in the year",
                    "DATE"
                ],
                [
                    "70",
                    "MONEY"
                ],
                [
                    "Krisztian Sandor",
                    "PERSON"
                ],
                [
                    "New York University's",
                    "ORG"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "SOL",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.062,
                    "neu": 0.87,
                    "pos": 0.068,
                    "compound": 0.1847
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "negative",
                    "score": 0.9999873638153076
                },
                {
                    "label": "negative",
                    "score": 0.9999651908874512
                },
                {
                    "label": "negative",
                    "score": 0.9999265670776367
                },
                {
                    "label": "negative",
                    "score": 0.9982719421386719
                },
                {
                    "label": "negative",
                    "score": 0.9999966621398926
                },
                {
                    "label": "positive",
                    "score": 0.9625996947288513
                },
                {
                    "label": "neutral",
                    "score": 0.9176117777824402
                }
            ],
            "bert_sentiment_summary": "negative",
            "entity_sentiment": {
                "Avalanche": {
                    "sentiment": "negative",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Polygon": {
                    "sentiment": "negative",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Uniswap": {
                    "sentiment": "negative",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Ethereum": {
                    "sentiment": "negative",
                    "confidence": 0.9999,
                    "mentions": 1
                },
                "Trump": {
                    "sentiment": "negative",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Bitcoin": {
                    "sentiment": "negative",
                    "confidence": 0.9999,
                    "mentions": 3
                },
                "2025": {
                    "sentiment": "neutral",
                    "confidence": 0.8569,
                    "mentions": 1
                }
            },
            "crypto_scores": {
                "2025": 0.2714,
                "Bitcoin": -0.6999,
                "Ethereum": -0.8999,
                "Avalanche": -0.9,
                "Polygon": -0.9,
                "Uniswap": -0.9,
                "Trump": -0.9
            },
            "topics": [
                [
                    "coindesk",
                    "economic",
                    "bitcoin",
                    "price",
                    "week",
                    "day",
                    "000",
                    "market",
                    "crypto",
                    "btc"
                ]
            ],
            "top_keywords_tfidf": [
                "btc",
                "crypto",
                "market"
            ]
        },
        "timestamp": "2025-03-29T21:08:01.589761+00:00"
    },
    {
        "title": "President Trump Pardons Arthur Hayes, BitMEX and 3 Other Co-Founders and Employee",
        "link": "https://www.coindesk.com/policy/2025/03/28/president-trump-pardons-arthur-hayes-2-other-bitmex-co-founders-cnbc",
        "published": "Fri, 28 Mar 2025 20:04:27 +0000",
        "summary": "Arthur Hayes speaks on stage during Bitcoin Conference 2023 (Photo by Jason Koerner/Getty Images for Bitcoin Magazine)",
        "content": "Arthur Hayes, the former CEO of crypto exchange BitMEX, has been granted a pardon by U.S. President Donald Trump, a White House official confirmed Friday.  Trump also pardoned Hayes’ co-founders at BitMEX, Samuel Reed and Benjamin Delo, as well as senior employee Greg Dwyer and BitMEX's operating entity, HDR Global Trading, a BitMEX spokesperson said. CNBC first reported the pardons, which the White House said were signed on Thursday. In 2020, the U.S. Department of Justice (DOJ) brought charges against BitMEX, its three co-founders, and its first employee, Dwyer, accusing them of violating the Bank Secrecy Act (BSA). Prosecutors alleged BitMEX advertised itself as a place where customers could use its platform virtually anonymously, without providing basic know-your-customer (KYC) information. All four individuals eventually pleaded guilty and were sentenced to fines and probationary sentences. The exchange itself pleaded guilty to violating the BSA last year. Hayes faced two years of probation; Delo spent 30 months on probation and Reed 18 months on probation. Dwyer got 12 months of probation. In a statement, Delo said he and his colleagues had been \"wrongfully targeted.\"  \"This full and unconditional pardon by President Trump is a vindication of the position we have always held — that BitMEX, my co-founders and I should never have been charged with a criminal offense through an obscure, antiquated law,\" he said. \"As the most successful crypto exchange of its kind, we were wrongfully made to serve as an example, sacrificed for political reasons and used to send inconsistent regulatory signals. I’m sincerely grateful to the President for granting this pardon to me and my co-founders.\" Hayes just said \"thank you\" on X (formerly known as Twitter). Thank you @POTUS The Commodity Futures Trading Commission ordered BitMEX to pay $100 million for violating the Commodity Exchange Act and other CFTC regulations in 2021, separately from its DOJ settlements. Attorneys representing Hayes, Delo and Reed did not immediately return requests for comment. The reported pardons come just a day after Trump granted a pardon to Trevor Milton, the former CEO of Nikola Motors who was previously convicted of fraud in 2022. In January, Trump made good on long-standing promises to pardon Silk Road creator Ross Ulbricht, who was 11 years into a draconian sentence of double life in prison plus 40 years, with no possibility of parole. Since Ulbricht’s pardon, former FTX CEO and convicted fraudster Sam Bankman-Fried has been angling for his own pardon, attempting to curry favor with the Trump administration and appearing on Tucker Carlson in an unauthorized jailhouse interview that landed him in solitary confinement. Former Binance CEO Changpeng \"CZ\" Zhao, who pleaded guilty to the same charge as Hayes and served four months in prison last year — making him not only the richest person to ever go to prison in the U.S., but also the only person to ever serve jail time for violating the BSA — has denied reports that he, too, is seeking a pardon from President Trump. But, Zhao admitted in a recent X post that “no felon would mind a pardon, especially being the only one in US history who was ever sentenced to prison for a single BSA charge.” UPDATE (March 28, 2025, 20:40 UTC): Adds Delo statement and White House official. UPDATE (March 28, 21:06 UTC): Adds Hayes. UPDATE (March 29, 04:15 UTC): Adds Dwyer and HDR. On the news team at CoinDesk, Cheyenne focuses on crypto regulation and crime. Cheyenne is originally from Houston, Texas. She studied political science at Tulane University in Louisiana. In December 2021, she graduated from CUNY's Craig Newmark Graduate School of Journalism, where she focused on business and economics reporting. She has no significant crypto holdings.  Nikhilesh De is CoinDesk's managing editor for global policy and regulation, covering regulators, lawmakers and institutions. When he's not reporting on digital assets and policy, he can be found admiring Amtrak or building LEGO trains. He owns < $50 in BTC and < $20 in ETH. He was named the Association of Cryptocurrency Journalists and Researchers' Journalist of the Year in 2020. About Contact",
        "analysis": {
            "entities": [
                [
                    "Arthur Hayes",
                    "PERSON"
                ],
                [
                    "BitMEX",
                    "EXCHANGE"
                ],
                [
                    "U.S.",
                    "GPE"
                ],
                [
                    "Donald Trump",
                    "PERSON"
                ],
                [
                    "White House",
                    "ORG"
                ],
                [
                    "Friday",
                    "DATE"
                ],
                [
                    "Trump",
                    "CRYPTO"
                ],
                [
                    "Hayes",
                    "PERSON"
                ],
                [
                    "Samuel Reed",
                    "PERSON"
                ],
                [
                    "Benjamin Delo",
                    "PERSON"
                ],
                [
                    "Greg Dwyer",
                    "PERSON"
                ],
                [
                    "CNBC",
                    "ORG"
                ],
                [
                    "first",
                    "ORDINAL"
                ],
                [
                    "the White House",
                    "ORG"
                ],
                [
                    "Thursday",
                    "DATE"
                ],
                [
                    "2020",
                    "DATE"
                ],
                [
                    "the U.S. Department of Justice",
                    "ORG"
                ],
                [
                    "three",
                    "CARDINAL"
                ],
                [
                    "Dwyer",
                    "PERSON"
                ],
                [
                    "BSA",
                    "ORG"
                ],
                [
                    "KYC",
                    "ORG"
                ],
                [
                    "four",
                    "CARDINAL"
                ],
                [
                    "last year",
                    "DATE"
                ],
                [
                    "two years",
                    "DATE"
                ],
                [
                    "Delo",
                    "PERSON"
                ],
                [
                    "30 months",
                    "DATE"
                ],
                [
                    "18 months",
                    "DATE"
                ],
                [
                    "12 months",
                    "DATE"
                ],
                [
                    "Twitter",
                    "PERSON"
                ],
                [
                    "The Commodity Futures Trading Commission",
                    "ORG"
                ],
                [
                    "$100 million",
                    "MONEY"
                ],
                [
                    "the Commodity Exchange Act",
                    "LAW"
                ],
                [
                    "CFTC",
                    "ORG"
                ],
                [
                    "2021",
                    "DATE"
                ],
                [
                    "DOJ",
                    "ORG"
                ],
                [
                    "Reed",
                    "PERSON"
                ],
                [
                    "Trevor Milton",
                    "PERSON"
                ],
                [
                    "Nikola Motors",
                    "ORG"
                ],
                [
                    "2022",
                    "DATE"
                ],
                [
                    "January",
                    "DATE"
                ],
                [
                    "Silk Road",
                    "FAC"
                ],
                [
                    "Ross Ulbricht",
                    "PERSON"
                ],
                [
                    "11 years",
                    "DATE"
                ],
                [
                    "40 years",
                    "DATE"
                ],
                [
                    "Ulbricht",
                    "ORG"
                ],
                [
                    "FTX",
                    "ORG"
                ],
                [
                    "Sam Bankman-Fried",
                    "PERSON"
                ],
                [
                    "Tucker Carlson",
                    "CRYPTO"
                ],
                [
                    "Binance",
                    "EXCHANGE"
                ],
                [
                    "Changpeng \"CZ\" Zhao",
                    "PERSON"
                ],
                [
                    "four months",
                    "DATE"
                ],
                [
                    "Zhao",
                    "PERSON"
                ],
                [
                    "US",
                    "GPE"
                ],
                [
                    "March 28, 2025",
                    "DATE"
                ],
                [
                    "UTC",
                    "ORG"
                ],
                [
                    "March 28",
                    "DATE"
                ],
                [
                    "March 29",
                    "DATE"
                ],
                [
                    "HDR",
                    "ORG"
                ],
                [
                    "Cheyenne",
                    "CRYPTO"
                ],
                [
                    "Houston",
                    "GPE"
                ],
                [
                    "Texas",
                    "GPE"
                ],
                [
                    "Tulane University",
                    "ORG"
                ],
                [
                    "Louisiana",
                    "GPE"
                ],
                [
                    "December 2021",
                    "DATE"
                ],
                [
                    "CUNY",
                    "ORG"
                ],
                [
                    "Craig Newmark Graduate School of Journalism",
                    "ORG"
                ],
                [
                    "Nikhilesh De",
                    "ORG"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "Amtrak",
                    "ORG"
                ],
                [
                    "LEGO",
                    "ORG"
                ],
                [
                    "50",
                    "MONEY"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "20",
                    "MONEY"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "the Association of Cryptocurrency Journalists",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.08,
                    "neu": 0.83,
                    "pos": 0.09,
                    "compound": -0.467
                },
                "label": "negative"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9258579015731812
                },
                {
                    "label": "negative",
                    "score": 0.9995447993278503
                },
                {
                    "label": "neutral",
                    "score": 0.9968536496162415
                },
                {
                    "label": "neutral",
                    "score": 0.8420323729515076
                },
                {
                    "label": "positive",
                    "score": 0.9102312922477722
                },
                {
                    "label": "neutral",
                    "score": 0.5679092407226562
                },
                {
                    "label": "neutral",
                    "score": 0.9999192953109741
                },
                {
                    "label": "neutral",
                    "score": 0.9999843835830688
                },
                {
                    "label": "neutral",
                    "score": 0.9999922513961792
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Trump": {
                    "sentiment": "neutral",
                    "confidence": 0.9663,
                    "mentions": 7
                },
                "Tucker Carlson": {
                    "sentiment": "negative",
                    "confidence": 0.9824,
                    "mentions": 1
                },
                "Cheyenne": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 2
                }
            },
            "crypto_scores": {
                "Trump": 0.6933,
                "Cheyenne": 0.4,
                "Tucker Carlson": -0.8824
            },
            "topics": [
                [
                    "months",
                    "probation",
                    "president",
                    "prison",
                    "delo",
                    "said",
                    "hayes",
                    "trump",
                    "bitmex",
                    "pardon"
                ]
            ],
            "top_keywords_tfidf": [
                "pardon",
                "bitmex",
                "trump"
            ]
        },
        "timestamp": "2025-03-29T21:08:03.296340+00:00"
    },
    {
        "title": "FDIC Reverses U.S. Crypto Banking Policy That Demanded Prior Approvals",
        "link": "https://www.coindesk.com/policy/2025/03/28/fdic-reverses-u-s-crypto-banking-policy-that-demanded-prior-approvals",
        "published": "Fri, 28 Mar 2025 18:33:38 +0000",
        "summary": "Federal Deposit Insurance Corp. (Jesse Hamilton/CoinDesk)",
        "content": "The Federal Deposit Insurance Corp. will no longer instruct banks to get prior sign-off before they engage in crypto activities — a standard that was set in 2022 and that effectively severed institutions from the digital assets sector as they waited for approvals that never came. The FDIC, which is the chief federal supervisor of thousands of typically smaller banks and runs the banking industry's government backstop, had occupied a significant role in the crypto debanking saga. A courtroom fight with crypto exchange Coinbase had recently unveiled dozens of letters between the regulator and banks it supervised. In that 2022 correspondence, the FDIC had instructed them to steer clear of new crypto matters while it hashed out policies, though the agency never developed any and left bankers hanging. The new industry guidance issued on Friday comes after President Donald Trump elevated a crypto-friendly leadership at the FDIC and other financial regulators and has directed his administration to open doors for the industry. “With today’s action, the FDIC is turning the page on the flawed approach of the past three years,” said FDIC Acting Chairman Travis Hill, in a statement. “I expect this to be one of several steps the FDIC will take to lay out a new approach for how banks can engage in crypto- and blockchain-related activities in accordance with safety and soundness standards.” Read More: Trump's FDIC Chief Rethinks Crypto Guidance as U.S. Senators Probe Debanking Banks that were once expected to get pre-approvals on crypto matters can now forge ahead, as long as they're appropriately considering the risks. Bo Hines, the White House's director of its council of digital assets advisers cheered the FDIC's move in a social media post, calling it a \"huge step forward.\" The guidance to seek pre-approvals was a common stance across all three U.S. banking agencies, including the Federal Reserve and the Office of the Comptroller of the Currency. The OCC also acted recently to rescind its similar 2022 guidance, which had emerged as the digital assets sector was beset by failure and high-profile fraud, and global exchange FTX was steering toward disaster. Read More: OCC Says Banks Can Engage in Crypto Custody and Certain Stablecoin Activities UPDATE (March 28, 2025, 18:42 UTC): Adds comment from a White House official. Jesse Hamilton is CoinDesk's deputy managing editor on the Global Policy and Regulation team, based in Washington, D.C. Before joining CoinDesk in 2022, he worked for more than a decade covering Wall Street regulation at Bloomberg News and Businessweek, writing about the early whisperings among federal agencies trying to decide what to do about crypto. He’s won several national honors in his reporting career, including from his time as a war correspondent in Iraq and as a police reporter for newspapers. Jesse is a graduate of Western Washington University, where he studied journalism and history. He has no crypto holdings.  About Contact",
        "analysis": {
            "entities": [
                [
                    "The Federal Deposit Insurance Corp.",
                    "ORG"
                ],
                [
                    "2022",
                    "DATE"
                ],
                [
                    "FDIC",
                    "ORG"
                ],
                [
                    "thousands",
                    "CARDINAL"
                ],
                [
                    "Coinbase",
                    "PERSON"
                ],
                [
                    "dozens",
                    "CARDINAL"
                ],
                [
                    "Friday",
                    "DATE"
                ],
                [
                    "Donald Trump",
                    "PERSON"
                ],
                [
                    "the past three years",
                    "DATE"
                ],
                [
                    "Travis Hill",
                    "PERSON"
                ],
                [
                    "Trump",
                    "CRYPTO"
                ],
                [
                    "U.S.",
                    "GPE"
                ],
                [
                    "Probe Debanking Banks",
                    "ORG"
                ],
                [
                    "Hines",
                    "ORG"
                ],
                [
                    "the White House's",
                    "ORG"
                ],
                [
                    "three",
                    "CARDINAL"
                ],
                [
                    "the Federal Reserve",
                    "ORG"
                ],
                [
                    "the Office of the Comptroller of the Currency",
                    "ORG"
                ],
                [
                    "OCC",
                    "ORG"
                ],
                [
                    "Banks Can Engage",
                    "PERSON"
                ],
                [
                    "March 28, 2025",
                    "DATE"
                ],
                [
                    "18:42",
                    "CARDINAL"
                ],
                [
                    "UTC",
                    "ORG"
                ],
                [
                    "White House",
                    "ORG"
                ],
                [
                    "Jesse Hamilton",
                    "PERSON"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "the Global Policy and Regulation",
                    "ORG"
                ],
                [
                    "Washington",
                    "GPE"
                ],
                [
                    "D.C.",
                    "GPE"
                ],
                [
                    "more than a decade",
                    "DATE"
                ],
                [
                    "Bloomberg News",
                    "ORG"
                ],
                [
                    "Businessweek",
                    "GPE"
                ],
                [
                    "Iraq",
                    "GPE"
                ],
                [
                    "Jesse",
                    "PERSON"
                ],
                [
                    "Western Washington University",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.053,
                    "neu": 0.869,
                    "pos": 0.078,
                    "compound": 0.765
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9904206991195679
                },
                {
                    "label": "neutral",
                    "score": 0.9997513890266418
                },
                {
                    "label": "neutral",
                    "score": 0.9903194904327393
                },
                {
                    "label": "neutral",
                    "score": 0.8824748396873474
                },
                {
                    "label": "neutral",
                    "score": 0.9974550604820251
                },
                {
                    "label": "neutral",
                    "score": 0.9999703168869019
                },
                {
                    "label": "neutral",
                    "score": 0.9979614019393921
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Trump": {
                    "sentiment": "neutral",
                    "confidence": 0.9993,
                    "mentions": 2
                }
            },
            "crypto_scores": {
                "Trump": 0.3999
            },
            "topics": [
                [
                    "activities",
                    "approvals",
                    "new",
                    "engage",
                    "2022",
                    "federal",
                    "guidance",
                    "banks",
                    "fdic",
                    "crypto"
                ]
            ],
            "top_keywords_tfidf": [
                "crypto",
                "fdic",
                "banks"
            ]
        },
        "timestamp": "2025-03-29T21:08:04.299893+00:00"
    },
    {
        "title": "CoreWeave Stock Debuts at $39 After Selling Shares for $40 A Piece",
        "link": "https://www.coindesk.com/markets/2025/03/28/coreweave-stock-debuts-at-usd39-after-selling-shares-for-usd40-a-piece",
        "published": "Fri, 28 Mar 2025 18:02:54 +0000",
        "summary": "Cloud Based Artificial Intelligence Computing Company CoreWeave Has IPO On Nasdaq Exchange. (Michael M. Santiago/Getty Images)",
        "content": "Shares of CoreWeave (CRWV) opened at $39 apiece during the company’s debut on Nasdaq on Friday afternoon, just under its initial public offering which closed Thursday evening. The cloud computing firm had sold roughly 37.5 million shares at $40 each, raising about $1.5 billion for its initial public offering (IPO), making it the largest tech offering since 2021. It had, however, initially planned to file the offering at $47 to $55 a share at a much higher valuation than it ultimately saw. Nvidia, an early investor in the company, placed a $250 million order in the offering. Some experts speculated that the stock’s debut wouldn’t see the success it had hoped for. Bloomberg Opinion US technology columnist Dave Lee, for example, pointed out the company’s large debt, reliance on just a few big customers and lack of diversity in revenue may be an issue. “CoreWeave stands to be a bellwether for the AI industry as a whole — a must-watch stock as questions about return on investment grow ever louder,” Lee wrote in an op-ed on Friday. “Even the slightest indication of shakiness in the belief of AI sends investors into a tailspin.” The current risk-off environment caused by the overall macro situation in the U.S., mainly due to recent tariffs imposed by U.S. President Donald Trump, which has caused a sell off in tech stocks, could also have weighed on CoreWeave’s IPO. Helene is a New York-based news reporter at CoinDesk, covering news about Wall Street, the rise of the spot bitcoin exchange-traded funds (ETFs) and updates on crypto exchanges. She is also the co-host of CoinDesk's Markets Daily show on Spotify and Youtube. Helene is a recent graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH. About Contact",
        "analysis": {
            "entities": [
                [
                    "39",
                    "MONEY"
                ],
                [
                    "Nasdaq",
                    "ORG"
                ],
                [
                    "Friday",
                    "DATE"
                ],
                [
                    "afternoon",
                    "TIME"
                ],
                [
                    "Thursday",
                    "DATE"
                ],
                [
                    "evening",
                    "TIME"
                ],
                [
                    "roughly 37.5 million",
                    "CARDINAL"
                ],
                [
                    "40",
                    "MONEY"
                ],
                [
                    "about $1.5 billion",
                    "MONEY"
                ],
                [
                    "IPO",
                    "ORG"
                ],
                [
                    "2021",
                    "DATE"
                ],
                [
                    "47",
                    "CRYPTO"
                ],
                [
                    "55",
                    "MONEY"
                ],
                [
                    "Nvidia",
                    "GPE"
                ],
                [
                    "$250 million",
                    "MONEY"
                ],
                [
                    "Bloomberg Opinion US",
                    "ORG"
                ],
                [
                    "Dave Lee",
                    "PERSON"
                ],
                [
                    "CoreWeave",
                    "ORG"
                ],
                [
                    "AI",
                    "GPE"
                ],
                [
                    "Lee",
                    "CRYPTO"
                ],
                [
                    "U.S.",
                    "GPE"
                ],
                [
                    "Donald Trump",
                    "PERSON"
                ],
                [
                    "CoreWeave’s IPO",
                    "PRODUCT"
                ],
                [
                    "New York",
                    "GPE"
                ],
                [
                    "CoinDesk's Markets Daily",
                    "ORG"
                ],
                [
                    "Spotify",
                    "GPE"
                ],
                [
                    "Youtube",
                    "GPE"
                ],
                [
                    "New York University's",
                    "ORG"
                ],
                [
                    "CBS News",
                    "ORG"
                ],
                [
                    "YahooFinance",
                    "ORG"
                ],
                [
                    "Nasdaq TradeTalks",
                    "ORG"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.026,
                    "neu": 0.932,
                    "pos": 0.042,
                    "compound": 0.7269
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.963140606880188
                },
                {
                    "label": "negative",
                    "score": 0.9999783039093018
                },
                {
                    "label": "negative",
                    "score": 0.9960696697235107
                },
                {
                    "label": "neutral",
                    "score": 0.9999934434890747
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "47": {
                    "sentiment": "neutral",
                    "confidence": 0.8624,
                    "mentions": 1
                },
                "Lee": {
                    "sentiment": "negative",
                    "confidence": 1.0,
                    "mentions": 2
                }
            },
            "crypto_scores": {
                "47": 0.2725,
                "Lee": -0.8
            },
            "topics": [
                [
                    "initial",
                    "million",
                    "ipo",
                    "helene",
                    "recent",
                    "public",
                    "coreweave",
                    "news",
                    "company",
                    "offering"
                ]
            ],
            "top_keywords_tfidf": [
                "offering",
                "company",
                "news"
            ]
        },
        "timestamp": "2025-03-29T21:08:05.072704+00:00"
    },
    {
        "title": "Crypto Card Firm Baanx Partners With Circle for Rewards Wallet",
        "link": "https://www.coindesk.com/business/2025/03/28/crypto-card-firm-baanx-partners-with-circle-for-rewards-wallet",
        "published": "Fri, 28 Mar 2025 18:00:00 +0000",
        "summary": "16:9 crop The Baanx team (Baanx) (2024)",
        "content": "Baanx, a cryptocurrency debit card enabler for the likes of MetaMask and 1inch, has introduced a rewards wallet combining on-chain finance with traditional loyalty perks and discounts, using underlying technology from Circle, the provider of the USDC stablecoin. Built on Circle’s programmable wallet tech, the Baanx platform allows crypto holders access to cashback, fee discounts, subscription perks and exclusive gated experiences, according to a press release. An ongoing convergence between traditional card networks and the on-chain world of stablecoins and decentralized finance (DeFi) has seen Mastercard partner with Web3 wallet MetaMask, and more recently reports of Visa in talks with Sam Altman’s World Network. The rewards wallet offering helps bridge the gap between blockchain and everyday financial needs, said Baanx Chief Commercial Officer Simon Jones. “We've built the Rewards Wallet using Circle to offer rewards on a crypto debit card that are unprecedented, and so incentivizing users to go down the route of non-custodial spend,” Jones said in an interview. “For instance, if you look at the MataMask card, it’s up to 6% cash-back for the first month.” Circle, famous as the creator of the $60 billion stablecoin USDC, offers programmable wallet infrastructure that allows for adding features to multiple crypto projects without having to change the user interface, Jones said. “We are pushing USDC as the main treasury token and incentive program within these products, as opposed to Tether [USDT],” he said. Sanja Kon, VP of partnerships & business development, Europe at Circle said in a statement: “Circle Wallets provide a fantastic foundation for the Rewards Wallet. By integrating this technology, Baanx is bringing real-world value to crypto users in new and exciting ways.”  Ian Allison is a senior reporter at CoinDesk, focused on institutional and enterprise adoption of cryptocurrency and blockchain technology. Prior to that, he covered fintech for the International Business Times in London and Newsweek online. He won the State Street Data and Innovation journalist of the year award in 2017, and was runner up the following year. He also earned CoinDesk an honourable mention in the 2020 SABEW Best in Business awards. His November 2022 FTX scoop, which brought down the exchange and its boss Sam Bankman-Fried, won a Polk award, Loeb award and New York Press Club award. Ian graduated from the University of Edinburgh. He holds ETH. About Contact",
        "analysis": {
            "entities": [
                [
                    "MetaMask",
                    "CARDINAL"
                ],
                [
                    "1inch",
                    "CARDINAL"
                ],
                [
                    "Circle",
                    "CRYPTO"
                ],
                [
                    "USDC",
                    "ORG"
                ],
                [
                    "Baanx",
                    "CRYPTO"
                ],
                [
                    "DeFi",
                    "ORG"
                ],
                [
                    "Mastercard",
                    "ORG"
                ],
                [
                    "Visa",
                    "CRYPTO"
                ],
                [
                    "Sam Altman’s",
                    "PERSON"
                ],
                [
                    "Baanx Chief",
                    "PERSON"
                ],
                [
                    "Simon Jones",
                    "PERSON"
                ],
                [
                    "Jones",
                    "CRYPTO"
                ],
                [
                    "MataMask",
                    "ORG"
                ],
                [
                    "up to 6%",
                    "PERCENT"
                ],
                [
                    "the first month",
                    "DATE"
                ],
                [
                    "$60 billion",
                    "MONEY"
                ],
                [
                    "Sanja Kon",
                    "PERSON"
                ],
                [
                    "VP",
                    "ORG"
                ],
                [
                    "partnerships & business development",
                    "ORG"
                ],
                [
                    "Europe",
                    "LOC"
                ],
                [
                    "Circle Wallets",
                    "WORK_OF_ART"
                ],
                [
                    "the Rewards Wallet",
                    "WORK_OF_ART"
                ],
                [
                    "Ian Allison",
                    "PERSON"
                ],
                [
                    "the International Business Times",
                    "ORG"
                ],
                [
                    "London",
                    "CRYPTO"
                ],
                [
                    "Newsweek",
                    "ORG"
                ],
                [
                    "the State Street Data",
                    "ORG"
                ],
                [
                    "the year",
                    "DATE"
                ],
                [
                    "2017",
                    "DATE"
                ],
                [
                    "the following year",
                    "DATE"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "2020",
                    "DATE"
                ],
                [
                    "November 2022",
                    "DATE"
                ],
                [
                    "FTX scoop",
                    "PRODUCT"
                ],
                [
                    "Sam Bankman-Fried",
                    "PERSON"
                ],
                [
                    "New York Press Club",
                    "ORG"
                ],
                [
                    "Ian",
                    "PERSON"
                ],
                [
                    "the University of Edinburgh",
                    "ORG"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.0,
                    "neu": 0.818,
                    "pos": 0.182,
                    "compound": 0.9972
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "positive",
                    "score": 0.6587861776351929
                },
                {
                    "label": "positive",
                    "score": 0.8956351280212402
                },
                {
                    "label": "neutral",
                    "score": 0.9670382142066956
                },
                {
                    "label": "neutral",
                    "score": 0.8001274466514587
                },
                {
                    "label": "neutral",
                    "score": 0.9998409748077393
                },
                {
                    "label": "neutral",
                    "score": 0.991969883441925
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Circle": {
                    "sentiment": "positive",
                    "confidence": 0.9093,
                    "mentions": 5
                },
                "Baanx": {
                    "sentiment": "positive",
                    "confidence": 1.0,
                    "mentions": 4
                },
                "Visa": {
                    "sentiment": "neutral",
                    "confidence": 0.9974,
                    "mentions": 1
                },
                "Jones": {
                    "sentiment": "positive",
                    "confidence": 0.995,
                    "mentions": 3
                },
                "London": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                }
            },
            "crypto_scores": {
                "Circle": 1.4093,
                "Baanx": 1.4,
                "Jones": 1.295,
                "London": 0.3,
                "Visa": 0.2995
            },
            "topics": [
                [
                    "usdc",
                    "technology",
                    "baanx",
                    "card",
                    "crypto",
                    "award",
                    "said",
                    "rewards",
                    "circle",
                    "wallet"
                ]
            ],
            "top_keywords_tfidf": [
                "wallet",
                "circle",
                "rewards"
            ]
        },
        "timestamp": "2025-03-29T21:08:06.258659+00:00"
    },
    {
        "title": "CoinDesk Weekly Recap: Stablecoins, Stablecoins, Stablecoins",
        "link": "https://www.coindesk.com/coindesk-news/2025/03/28/coindesk-weekly-recap-stablecoins-stablecoins-stablecoins",
        "published": "Fri, 28 Mar 2025 16:46:08 +0000",
        "summary": "Don Jnr",
        "content": "It was a bad week for crypto prices, with BTC and ETH both falling and the CoinDesk 20, which covers 80% of the market, losing 7% since Monday.  But less speculative assets showed plenty of volume. Stablecoins, in particular, were the name of the game this week.  The U.S. House introduced a stablecoin bill, following up on the Senate version that was approved by committee last week. Jesse Hamilton reported. Wyoming (aka “The Blockchain State”) wants its own stablecoin and it’s testing the idea on Avalanche, Solana and Ethereum, Kris Sandor reported. World Liberty Financial (WLFI), the financial protocol backed by Donald Trump and his family, confirmed the launch of its stablecoin (USD1) this week. And Don Trump Jr. trumpeted the news at the DC Blockchain Summit. Meanwhile, Fidelity Investment, an early TradFi innovator in crypto, is in the advanced stages of launching its own stablecoin. The venture is part of a strategy to enter the tokenized bond market, Jamie Crawley reported. Meanwhile, Circle, the issuer of the second biggest stablecoin (USDC), has finally secured a license to operate in Japan in partnership with local heavyweight SBI Holdings, Sam Reynolds reported. In news from our Europe team, Ian Allison had a scoop about Sam Altman's World Network holding talks with Visa on linking on-chain card features to a self-custody crypto wallet. Will Canny heard from a source that Sam Hill, Zodia Custody's COO had left and was returning to a role in TradFi. He was able to persuade the Standard Chartered-backed company to confirm the move and we beat the competition with the story. Canny followed up the next day with a story, unreported elsewhere, on the wave of senior staff losses at crypto prime broker FalconX. (BlackRock, by contrast, was adding talent to its digital assets team in the U.S.) We continued to report on Strategy (MicroStrategy), pioneer of the corporate bitcoin treasury. Christine Lee had a two-hour interview with executive chairman Michael Saylor, where he mused about bitcoin as a $200 trillion asset and promised to burn bitcoin in the name of immortality.  Strategy has invested about $33 billion in bitcoin so far through various stock offerings, both common and preferred. And James Van Straten explained the differences between the company's fund-raising instruments for bitcoin purchases. Tom Carreras followed up later with a nice piece showing how MSTR stockholders might be at risk from Saylor’s buy-every-bitcoin strategy. Meanwhile, the SEC continued to drop enforcement actions against crypto companies (Immutable was the latest, as Cheyenne Ligon reported). But, strangely, one involving Unicoin stayed open, much to the CEO’s chagrin. It almost felt like a normal sort of week — more incremental than monumental. But then the president’s own media company announced that it was launching its own ETFs and ETPs with Crypto.com. Thankfully, crypto still has the power to surprise. Benjamin Schiller is CoinDesk's managing editor for features and opinion. Previously, he was editor-in-chief at BREAKER Magazine and a staff writer at Fast Company. He holds some ETH, BTC and LINK.  Sheldon Reback is CoinDesk editorial's Regional Head of Europe. Before joining the company, he spent 26 years as an editor at Bloomberg News, where he worked on beats as diverse as stock markets and the retail industry as well as covering the dot-com bubble of 2000-2002. He managed the Bloomberg Terminal's main news page and also worked on a global project to produce short, chart-based stories across the newsroom. He previously worked as a journalist for a number of technology magazines in Hong Kong. Sheldon has a degree in industrial chemistry and an MBA. He owns ether and bitcoin below CoinDesk's notifiable limit. About Contact",
        "analysis": {
            "entities": [
                [
                    "a bad week",
                    "DATE"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "the CoinDesk 20",
                    "PRODUCT"
                ],
                [
                    "80%",
                    "PERCENT"
                ],
                [
                    "7%",
                    "PERCENT"
                ],
                [
                    "Monday",
                    "DATE"
                ],
                [
                    "this week",
                    "DATE"
                ],
                [
                    "The U.S. House",
                    "ORG"
                ],
                [
                    "Senate",
                    "CRYPTO"
                ],
                [
                    "last week",
                    "DATE"
                ],
                [
                    "Jesse Hamilton",
                    "PERSON"
                ],
                [
                    "The Blockchain State",
                    "WORK_OF_ART"
                ],
                [
                    "Avalanche",
                    "CRYPTO"
                ],
                [
                    "Solana",
                    "CRYPTO"
                ],
                [
                    "Ethereum",
                    "CRYPTO"
                ],
                [
                    "Kris Sandor",
                    "PERSON"
                ],
                [
                    "World Liberty Financial (WLFI",
                    "ORG"
                ],
                [
                    "Donald Trump",
                    "PERSON"
                ],
                [
                    "USD1",
                    "ORG"
                ],
                [
                    "Don Trump Jr.",
                    "PERSON"
                ],
                [
                    "the DC Blockchain Summit",
                    "FAC"
                ],
                [
                    "Fidelity Investment",
                    "ORG"
                ],
                [
                    "Jamie Crawley",
                    "PERSON"
                ],
                [
                    "Circle",
                    "CRYPTO"
                ],
                [
                    "second",
                    "ORDINAL"
                ],
                [
                    "USDC",
                    "ORG"
                ],
                [
                    "Japan",
                    "CRYPTO"
                ],
                [
                    "SBI Holdings",
                    "ORG"
                ],
                [
                    "Sam Reynolds",
                    "PERSON"
                ],
                [
                    "Europe",
                    "LOC"
                ],
                [
                    "Ian Allison",
                    "PERSON"
                ],
                [
                    "Sam Altman's",
                    "PERSON"
                ],
                [
                    "World Network",
                    "ORG"
                ],
                [
                    "Visa",
                    "CRYPTO"
                ],
                [
                    "Will Canny",
                    "PERSON"
                ],
                [
                    "Sam Hill",
                    "PERSON"
                ],
                [
                    "Zodia Custody's",
                    "PERSON"
                ],
                [
                    "Standard Chartered",
                    "ORG"
                ],
                [
                    "Canny",
                    "PERSON"
                ],
                [
                    "the next day",
                    "DATE"
                ],
                [
                    "BlackRock",
                    "ORG"
                ],
                [
                    "U.S.",
                    "GPE"
                ],
                [
                    "MicroStrategy",
                    "ORG"
                ],
                [
                    "Christine Lee",
                    "PERSON"
                ],
                [
                    "two-hour",
                    "TIME"
                ],
                [
                    "Michael Saylor",
                    "PERSON"
                ],
                [
                    "$200 trillion",
                    "MONEY"
                ],
                [
                    "about $33 billion",
                    "MONEY"
                ],
                [
                    "James Van Straten",
                    "PERSON"
                ],
                [
                    "Tom Carreras",
                    "PERSON"
                ],
                [
                    "MSTR",
                    "ORG"
                ],
                [
                    "Saylor’s",
                    "ORG"
                ],
                [
                    "SEC",
                    "ORG"
                ],
                [
                    "Cheyenne Ligon",
                    "PERSON"
                ],
                [
                    "one",
                    "CARDINAL"
                ],
                [
                    "Unicoin",
                    "PERSON"
                ],
                [
                    "Crypto.com",
                    "ORG"
                ],
                [
                    "Benjamin Schiller",
                    "PERSON"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "BREAKER Magazine",
                    "ORG"
                ],
                [
                    "Fast Company",
                    "ORG"
                ],
                [
                    "Sheldon Reback",
                    "PERSON"
                ],
                [
                    "Regional Head of",
                    "ORG"
                ],
                [
                    "26 years",
                    "DATE"
                ],
                [
                    "Bloomberg News",
                    "ORG"
                ],
                [
                    "2000-2002",
                    "DATE"
                ],
                [
                    "the Bloomberg Terminal's",
                    "ORG"
                ],
                [
                    "Hong Kong",
                    "GPE"
                ],
                [
                    "Sheldon",
                    "ORG"
                ],
                [
                    "MBA",
                    "WORK_OF_ART"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.033,
                    "neu": 0.886,
                    "pos": 0.081,
                    "compound": 0.9806
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9997205138206482
                },
                {
                    "label": "neutral",
                    "score": 0.9847886562347412
                },
                {
                    "label": "neutral",
                    "score": 0.9998170733451843
                },
                {
                    "label": "neutral",
                    "score": 0.999713122844696
                },
                {
                    "label": "neutral",
                    "score": 0.9999676942825317
                },
                {
                    "label": "neutral",
                    "score": 0.997077465057373
                },
                {
                    "label": "neutral",
                    "score": 0.9999867677688599
                },
                {
                    "label": "neutral",
                    "score": 0.999974250793457
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Senate": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Avalanche": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Solana": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Ethereum": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Circle": {
                    "sentiment": "neutral",
                    "confidence": 0.9986,
                    "mentions": 1
                },
                "Japan": {
                    "sentiment": "neutral",
                    "confidence": 0.9986,
                    "mentions": 1
                },
                "Visa": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                }
            },
            "crypto_scores": {
                "Senate": 0.3,
                "Avalanche": 0.3,
                "Solana": 0.3,
                "Ethereum": 0.3,
                "Visa": 0.3,
                "Circle": 0.2997,
                "Japan": 0.2997
            },
            "topics": [
                [
                    "worked",
                    "coindesk",
                    "strategy",
                    "news",
                    "company",
                    "stablecoin",
                    "reported",
                    "week",
                    "crypto",
                    "bitcoin"
                ]
            ],
            "top_keywords_tfidf": [
                "bitcoin",
                "crypto",
                "week"
            ]
        },
        "timestamp": "2025-03-29T21:08:07.578369+00:00"
    },
    {
        "title": "A Public Company Boasting Trump's Sons on Advisory Board Is Buying BlackRock Bitcoin ETFs",
        "link": "https://www.coindesk.com/business/2025/03/28/a-public-company-boasting-trump-s-sons-on-advisory-board-is-buying-blackrock-bitcoin-etfs",
        "published": "Fri, 28 Mar 2025 15:05:16 +0000",
        "summary": "Dominari Holdings, located in the Trump Tower in New York City, made headlines last month after the Trump brothers joined its 58-year-old board of advisors and became investors. (Getty Images)",
        "content": "An investment firm with ties to U.S. President Donald Trump’s sons, Eric and Donald Trump Jr., is putting some of its excess cash into a spot bitcoin exchange-traded fund (ETF) — an unusual twist on the increasingly popular strategy of holding bitcoin as a corporate reserve. Dominari Holdings (DOMH), located in the Trump Tower in New York City, made headlines last month after the Trump brothers joined its 58-year-old board of advisors and became investors. In an earnings report on Friday, it announced that it would adopt a bitcoin reserve strategy and invest a portion of its cash reserves into BlackRock’s iShares Bitcoin Trust (IBIT), the largest spot bitcoin ETF on the market. According to the report, Dominari has committed $2 million to buy shares of IBIT as of now. The stock has a market cap of about $70 million and has fallen more than 9% on Friday's trading. Most companies that adopt a bitcoin reserve strategy buy the cryptocurrency outright and self-custody it or use a custodian. Dominari is instead gaining exposure through a regulated exchange-traded fund, a move that may appeal to firms looking for easier compliance and cleaner accounting. The move isn’t surprising, given Donald Trump Jr.’s interest in crypto. The president’s son is involved in many crypto projects and has become an unofficial spokesperson for his father’s enthusiasm. Just earlier this week, World Liberty Financial (WLFI), the financial protocol backed by President Donald Trump and his family, pitched its own stablecoin at a crypto event in Washington. Helene is a New York-based news reporter at CoinDesk, covering news about Wall Street, the rise of the spot bitcoin exchange-traded funds (ETFs) and updates on crypto exchanges. She is also the co-host of CoinDesk's Markets Daily show on Spotify and Youtube. Helene is a recent graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH. About Contact",
        "analysis": {
            "entities": [
                [
                    "U.S.",
                    "GPE"
                ],
                [
                    "Donald Trump",
                    "PERSON"
                ],
                [
                    "Eric",
                    "CRYPTO"
                ],
                [
                    "Donald Trump Jr.",
                    "PERSON"
                ],
                [
                    "Dominari Holdings",
                    "ORG"
                ],
                [
                    "DOMH",
                    "ORG"
                ],
                [
                    "the Trump Tower",
                    "FAC"
                ],
                [
                    "New York City",
                    "GPE"
                ],
                [
                    "last month",
                    "DATE"
                ],
                [
                    "Trump",
                    "CRYPTO"
                ],
                [
                    "58-year-old",
                    "DATE"
                ],
                [
                    "Friday",
                    "DATE"
                ],
                [
                    "BlackRock’s iShares Bitcoin Trust",
                    "ORG"
                ],
                [
                    "IBIT",
                    "ORG"
                ],
                [
                    "ETF",
                    "PRODUCT"
                ],
                [
                    "Dominari",
                    "ORG"
                ],
                [
                    "$2 million",
                    "MONEY"
                ],
                [
                    "about $70 million",
                    "MONEY"
                ],
                [
                    "more than 9%",
                    "PERCENT"
                ],
                [
                    "Donald Trump Jr.’s",
                    "PERSON"
                ],
                [
                    "’s son",
                    "PERSON"
                ],
                [
                    "Just earlier this week",
                    "DATE"
                ],
                [
                    "World Liberty Financial (",
                    "ORG"
                ],
                [
                    "Washington",
                    "GPE"
                ],
                [
                    "New York",
                    "GPE"
                ],
                [
                    "CoinDesk's Markets Daily",
                    "ORG"
                ],
                [
                    "Spotify",
                    "GPE"
                ],
                [
                    "Youtube",
                    "GPE"
                ],
                [
                    "New York University's",
                    "ORG"
                ],
                [
                    "CBS News",
                    "ORG"
                ],
                [
                    "YahooFinance",
                    "ORG"
                ],
                [
                    "Nasdaq TradeTalks",
                    "ORG"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.008,
                    "neu": 0.891,
                    "pos": 0.101,
                    "compound": 0.9779
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9931649565696716
                },
                {
                    "label": "neutral",
                    "score": 0.9999380111694336
                },
                {
                    "label": "neutral",
                    "score": 0.7508524656295776
                },
                {
                    "label": "neutral",
                    "score": 0.9999945163726807
                },
                {
                    "label": "neutral",
                    "score": 0.9981202483177185
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Eric": {
                    "sentiment": "neutral",
                    "confidence": 0.791,
                    "mentions": 1
                },
                "Trump": {
                    "sentiment": "neutral",
                    "confidence": 0.9717,
                    "mentions": 4
                }
            },
            "crypto_scores": {
                "Trump": 0.5943,
                "Eric": 0.2582
            },
            "topics": [
                [
                    "reserve",
                    "president",
                    "strategy",
                    "spot",
                    "dominari",
                    "york",
                    "crypto",
                    "donald",
                    "trump",
                    "bitcoin"
                ]
            ],
            "top_keywords_tfidf": [
                "bitcoin",
                "trump",
                "donald"
            ]
        },
        "timestamp": "2025-03-29T21:08:08.539441+00:00"
    },
    {
        "title": "Strategy Holders Might be at Risk From Michael Saylor's Financial Wizardry",
        "link": "https://www.coindesk.com/markets/2025/03/28/strategy-holders-might-be-at-risk-from-michael-saylor-s-financial-wizardry",
        "published": "Fri, 28 Mar 2025 14:32:03 +0000",
        "summary": "MicroStrategy Executive Chairman Michael Saylor (Credit: CoinDesk/Danny Nelson)",
        "content": "Is Strategy (MSTR) in trouble? Led by Executive Chairman Michael Saylor, the firm formerly known as MicroStrategy has vacuumed up 506,137 bitcoin (BTC), currently worth roughly $44 billion at BTC's current price near $87,000, in the span of about five years. To the casual observer, the company seems to have a magic, unlimited pool of funds from which to draw on to buy more bitcoin. But Strategy acquired a sizable chunk of its stash by issuing billions of dollars in equity and convertible notes (debt securities which can be converted into equity under special conditions), and more recently via the issuance of preferred stock, a type of equity that provides dividends to investors. However, the price of bitcoin has been pushed down about 20% since peaking above $109,000 two months ago. And though such swings in prices are far from unusual, the particularly aggressive recent purchases by Saylor and team mean Strategy's average acquisition price has risen to $66,000. The company is really only one more moderate swing down in price from being in the red on its buys. Which begs the question: Could all of Strategy’s financial wizardry end up backfiring on the company should bitcoin keep heading lower? “It's highly unlikely that it results in a scenario where [Strategy] has to liquidate a bunch of bitcoin because it gets margin called,” Quinn Thompson, founder of crypto hedge fund Lekker Capital, told CoinDesk in an interview. “For the most part, the debt is very likely to be able to be refinanced for the convertible notes. And then [the firm] started issuing this perpetual preferred stock, which never has to be repaid.” In other words, not only is there very little chance that Strategy could suffer the kind of blowup that shook over crypto firms and projects in 2022 (like Genesis or Three Arrows Capital), but the firm has even refrained from posting its bitcoin holdings as collateral for loans — with the exception of a loan taken from Silvergate, which was repaid in 2023. Even so, that does not necessarily mean that it’s blue skies ahead for MSTR investors, because under various scenarios, Saylor could be forced to issue more equity than the market can handle in order to maintain course. “If he’s not paying dividends with Strategy’s cash flow, he's going to issue more shares and wreck the stock price. But it's no different than what he's doing already. Every time the retail bids it up, he wrecks the stock price by issuing more shares. In the future, he will have to do that, and the flows might not go into bitcoin. They might go to repay these debtors, and it will hurt the share price,” Thompson said. Strategy currently employs three different methods for raising capital: it can issue equity, convertible notes, or preferred stock. Issuing equity means that Strategy creates new MSTR shares, sells them on the market, and uses the proceeds to buy bitcoin. Naturally, that creates selling pressure on MSTR and can potentially push the stock downward. Convertible notes have allowed Strategy to raise funds quickly without diluting MSTR stock. Typically, investors like these notes because they offer a solid yield, they benefit if the stock surges, and they can usually be redeemed in cash for an amount equal to the original investment in addition to interest payments. The tremendous volatility of Strategy’s convertible notes, however, has allowed the company to mostly issue them at a zero percent interest rate and still meet high demand from sophisticated market participants, who have made bank trading that volatility. Finally, Strategy has begun deploying preferred stocks. These are instruments that tend to appeal to investors seeking lower volatility and more predictable returns through dividends. There are currently two offerings: STRK, which gives an 8% annual return; and STRF, which pays 10% annualized. But why is Strategy issuing all of these different types of investment vehicles? The idea is to create demand for Strategy for all kinds of investors that may have different tolerances to risk, Jeffrey Park, head of Alpha Strategies at crypto asset management Bitwise, told CoinDesk in an interview. “The convertible bond investors and the common equity investors were generally aligned in that they were both volatility seeking structures,” Park said. “Preferred equities are different. They actually are favored by investors who want to minimize volatility at all costs for a steady, reliable and high coupon that they feel is worth the credit risk.” “Strategy’s capital structure is almost like a seesaw in a playground,” Park added. “The common shareholders and converts are on one side, the preferred equity holders are on the other side. As sentiment shifts, the weights move around, and it tilts the value between these securities. But no matter how the seesaw moves, its total weight — which is Strategy’s enterprise value — remains the same. It’s just a redistribution of people's perceived value across the liabilities that exist on the company's balance sheet.” Even so, Strategy now finds itself in a situation where it must pay 8% dividends on STRK, 10% dividends on STRF, and a blend of 0.4% interest rate on its convertible bonds. With Strategy’s software business providing very little cash flow, finding the funds to pay for all of these dividends might be tricky. The company will likely need to keep issuing MSTR stock to pay the interest it owes, Thompson said. “It will hurt the share price. In the most extreme scenario, the stock could trade at a discount [from its bitcoin holdings], because he would be having to issue shares to pay interest and cover cash flow.” “The really draconian scenario would be for the discount to get so wide, like 20% or 30%, like Grayscale’s GBTC [prior to its conversion into an ETF], that the shareholders riot and tell him to buy back shares and close the discount,” Thompson added. “Right now, he's adding shareholder value by selling the stock at an elevated price and buying bitcoin, but in the future the reverse might be true, where the best way to add shareholder value would be to sell the bitcoin and buy the stock. But that's quite far away.” Saylor lost controlling voting power over the company in 2024 due to the continuous issuance of MSTR stock, meaning that the scenario above could theoretically happen, especially if activist investors decided to get involved. Another potential risk for MSTR holders is that the 2x long Strategy exchange-traded funds (ETFs) issued by T-Rex and Defiance, MSTX and MSTU, have seen weirdly persistent demand despite the stock’s drawdown. Every time investors want to gain or increase their exposure to these ETFs, the issuers have to buy twice as many MSTR shares. The popularity of these ETFs has helped create constant buying pressure for MSTR — so far, they’ve accumulated over $3 billion in MSTR exposure. The problem is that the music might stop someday. And if these ETFs begin to sell off their MSTR shares, the reaction on the stock price could be violent. “I don't know where the endless capital comes from to buy the dip. These ETFs have gotten obliterated. They're down huge,” Thompson said. “I mean, this is not a structural move up in the demand curve that you should count on. It’s not something you should really bake into your 10-year predictions of bitcoin price, but as long as it's existing, it's important for bitcoin. So I'm continually amazed by it.” Tom writes about markets, bitcoin mining and crypto adoption in Latin America. He has a bachelor's degree in English literature from McGill University, and can usually be found in Costa Rica. He holds BTC above CoinDesk's disclosure threshold of $1,000. About Contact",
        "analysis": {
            "entities": [
                [
                    "Michael Saylor",
                    "PERSON"
                ],
                [
                    "MicroStrategy",
                    "ORG"
                ],
                [
                    "506,137",
                    "CARDINAL"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "roughly $44 billion",
                    "MONEY"
                ],
                [
                    "87,000",
                    "MONEY"
                ],
                [
                    "about five years",
                    "DATE"
                ],
                [
                    "billions of dollars",
                    "MONEY"
                ],
                [
                    "about 20%",
                    "PERCENT"
                ],
                [
                    "above $109,000",
                    "MONEY"
                ],
                [
                    "two months ago",
                    "DATE"
                ],
                [
                    "Saylor",
                    "PERSON"
                ],
                [
                    "66,000",
                    "MONEY"
                ],
                [
                    "only one",
                    "CARDINAL"
                ],
                [
                    "Quinn Thompson",
                    "PERSON"
                ],
                [
                    "Lekker Capital",
                    "ORG"
                ],
                [
                    "2022",
                    "DATE"
                ],
                [
                    "Genesis",
                    "CRYPTO"
                ],
                [
                    "Three",
                    "CRYPTO"
                ],
                [
                    "Silvergate",
                    "ORG"
                ],
                [
                    "2023",
                    "DATE"
                ],
                [
                    "MSTR",
                    "ORG"
                ],
                [
                    "Thompson",
                    "ORG"
                ],
                [
                    "three",
                    "CARDINAL"
                ],
                [
                    "zero percent",
                    "PERCENT"
                ],
                [
                    "two",
                    "CARDINAL"
                ],
                [
                    "8%",
                    "PERCENT"
                ],
                [
                    "annual",
                    "DATE"
                ],
                [
                    "STRF",
                    "ORG"
                ],
                [
                    "10%",
                    "PERCENT"
                ],
                [
                    "Jeffrey Park",
                    "PERSON"
                ],
                [
                    "Alpha Strategies",
                    "ORG"
                ],
                [
                    "Bitwise",
                    "ORG"
                ],
                [
                    "Park",
                    "CRYPTO"
                ],
                [
                    "STRK",
                    "ORG"
                ],
                [
                    "0.4%",
                    "PERCENT"
                ],
                [
                    "20% or",
                    "PERCENT"
                ],
                [
                    "30%",
                    "PERCENT"
                ],
                [
                    "Grayscale’s",
                    "WORK_OF_ART"
                ],
                [
                    "2024",
                    "DATE"
                ],
                [
                    "2x",
                    "CARDINAL"
                ],
                [
                    "T-Rex",
                    "PERSON"
                ],
                [
                    "Defiance",
                    "ORG"
                ],
                [
                    "MSTX",
                    "ORG"
                ],
                [
                    "MSTU",
                    "ORG"
                ],
                [
                    "over $3 billion",
                    "MONEY"
                ],
                [
                    "10-year",
                    "DATE"
                ],
                [
                    "Tom",
                    "CRYPTO"
                ],
                [
                    "Latin America",
                    "LOC"
                ],
                [
                    "English",
                    "LANGUAGE"
                ],
                [
                    "McGill University",
                    "ORG"
                ],
                [
                    "Costa Rica",
                    "GPE"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "1,000",
                    "MONEY"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.068,
                    "neu": 0.817,
                    "pos": 0.115,
                    "compound": 0.9968
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "negative",
                    "score": 0.6045618057250977
                },
                {
                    "label": "positive",
                    "score": 0.8680082559585571
                },
                {
                    "label": "negative",
                    "score": 0.9365572929382324
                },
                {
                    "label": "negative",
                    "score": 0.5738210678100586
                },
                {
                    "label": "neutral",
                    "score": 0.9953773021697998
                },
                {
                    "label": "negative",
                    "score": 0.9708398580551147
                },
                {
                    "label": "positive",
                    "score": 0.999998927116394
                },
                {
                    "label": "neutral",
                    "score": 0.9712523818016052
                },
                {
                    "label": "neutral",
                    "score": 0.9997896552085876
                },
                {
                    "label": "neutral",
                    "score": 0.9999065399169922
                },
                {
                    "label": "negative",
                    "score": 0.9999563694000244
                },
                {
                    "label": "neutral",
                    "score": 0.9996815919876099
                },
                {
                    "label": "negative",
                    "score": 0.9999189376831055
                },
                {
                    "label": "negative",
                    "score": 0.9996627569198608
                },
                {
                    "label": "neutral",
                    "score": 0.7702788710594177
                },
                {
                    "label": "neutral",
                    "score": 0.9999785423278809
                }
            ],
            "bert_sentiment_summary": "negative",
            "entity_sentiment": {
                "Genesis": {
                    "sentiment": "negative",
                    "confidence": 0.9991,
                    "mentions": 1
                },
                "Three": {
                    "sentiment": "negative",
                    "confidence": 0.9991,
                    "mentions": 1
                },
                "Park": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 3
                },
                "Tom": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                }
            },
            "crypto_scores": {
                "Park": 0.5,
                "Tom": 0.3,
                "Genesis": -0.8991,
                "Three": -0.8991
            },
            "topics": [
                [
                    "convertible",
                    "shares",
                    "company",
                    "equity",
                    "investors",
                    "price",
                    "mstr",
                    "bitcoin",
                    "stock",
                    "strategy"
                ]
            ],
            "top_keywords_tfidf": [
                "strategy",
                "stock",
                "bitcoin"
            ]
        },
        "timestamp": "2025-03-29T21:08:10.300954+00:00"
    },
    {
        "title": "Crypto Bill to Combat Illicit Activity Gets New Push After Passing U.S. House in 2024",
        "link": "https://www.coindesk.com/policy/2025/03/28/crypto-bill-to-combat-illicit-activity-gets-new-push-after-passing-u-s-house-in-2024",
        "published": "Fri, 28 Mar 2025 14:17:29 +0000",
        "summary": "Representative Zach Nunn",
        "content": "U.S. Representatives Zach Nunn (R-Iowa) and Jim Himes (D-Conn.) reintroduced a bill to help combat illicit finance and terrorist financing on digital asset platforms after the previous version passed the House of Representatives last year failed to make progress in the Senate before the end of the congressional session. The Financial Technology Protection Act (FTPA) introduced on Thursday would set up an interagency working group, also including crypto industry insiders, to scrutinize activity related to terrorism and digital assets.  An earlier version of the bill was cleared in a routine vote by the House in July. \"Digital assets are an increasingly integral part of the global financial system, and it’s essential that the United States takes a thoughtful approach to security and innovation to maintain its leadership position,\" the Director of US Policy at Crypto Council for Innovation, Rashan Colbert said in a statement supporting the bill.   The proposed working group would include representatives from the Department of Justice, Treasury's Financial Crimes Enforcement Network, Federal Bureau of Investigation, Department of State, the Internal Revenue Service and others.  This bipartisan bill was among several crypto initiatives that won House support last year, and efforts to address illicit-finance concerns have always been among the top issues that lawmakers — especially Democrats — have sought to enact. The new administration of President Donald Trump has embraced and called for digital assets legislation, but more notably for stablecoin regulation and a comprehensive bill to set the rules for structuring the U.S. crypto markets.  Camomile Shumba is a CoinDesk regulatory reporter based in the UK. Previously, Shumba interned at Business Insider and Bloomberg. Camomile has featured in Harpers Bazaar, Red, the BBC, Black Ballad, Journalism.co.uk, Cryptopolitan.com and South West Londoner.\n\nShumba studied politics, philosophy and economics as a combined degree at the University of East Anglia before doing a postgraduate degree in multimedia journalism. While she did her undergraduate degree she had an award-winning radio show on making a difference. She does not currently hold value in any digital currencies or projects. About Contact",
        "analysis": {
            "entities": [
                [
                    "U.S. Representatives Zach Nunn",
                    "ORG"
                ],
                [
                    "Jim Himes",
                    "PERSON"
                ],
                [
                    "the House of Representatives",
                    "ORG"
                ],
                [
                    "last year",
                    "DATE"
                ],
                [
                    "Senate",
                    "CRYPTO"
                ],
                [
                    "The Financial Technology Protection Act",
                    "ORG"
                ],
                [
                    "FTPA",
                    "ORG"
                ],
                [
                    "Thursday",
                    "DATE"
                ],
                [
                    "House",
                    "ORG"
                ],
                [
                    "July",
                    "DATE"
                ],
                [
                    "Digital",
                    "ORG"
                ],
                [
                    "the United States",
                    "GPE"
                ],
                [
                    "US Policy",
                    "ORG"
                ],
                [
                    "Crypto Council for Innovation",
                    "ORG"
                ],
                [
                    "Rashan Colbert",
                    "PERSON"
                ],
                [
                    "the Department of Justice",
                    "ORG"
                ],
                [
                    "Treasury",
                    "ORG"
                ],
                [
                    "Financial Crimes Enforcement Network",
                    "ORG"
                ],
                [
                    "Federal Bureau of Investigation, Department of State",
                    "ORG"
                ],
                [
                    "the Internal Revenue Service",
                    "ORG"
                ],
                [
                    "Democrats",
                    "NORP"
                ],
                [
                    "Donald Trump",
                    "PERSON"
                ],
                [
                    "U.S.",
                    "GPE"
                ],
                [
                    "Camomile Shumba",
                    "PERSON"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "UK",
                    "GPE"
                ],
                [
                    "Shumba",
                    "PERSON"
                ],
                [
                    "Business Insider",
                    "ORG"
                ],
                [
                    "Bloomberg",
                    "GPE"
                ],
                [
                    "Harpers Bazaar",
                    "GPE"
                ],
                [
                    "Red",
                    "CRYPTO"
                ],
                [
                    "BBC",
                    "ORG"
                ],
                [
                    "Black Ballad",
                    "ORG"
                ],
                [
                    "Journalism.co.uk",
                    "ORG"
                ],
                [
                    "Cryptopolitan.com",
                    "ORG"
                ],
                [
                    "South West Londoner",
                    "GPE"
                ],
                [
                    "the University of East Anglia",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.035,
                    "neu": 0.874,
                    "pos": 0.092,
                    "compound": 0.8734
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9499461650848389
                },
                {
                    "label": "neutral",
                    "score": 0.9975550770759583
                },
                {
                    "label": "neutral",
                    "score": 0.8583946228027344
                },
                {
                    "label": "neutral",
                    "score": 0.9999982118606567
                },
                {
                    "label": "neutral",
                    "score": 0.9999381303787231
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Senate": {
                    "sentiment": "negative",
                    "confidence": 0.5318,
                    "mentions": 1
                },
                "Red": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                }
            },
            "crypto_scores": {
                "Red": 0.3,
                "Senate": -0.4318
            },
            "topics": [
                [
                    "year",
                    "version",
                    "representatives",
                    "shumba",
                    "degree",
                    "financial",
                    "assets",
                    "house",
                    "crypto",
                    "digital"
                ]
            ],
            "top_keywords_tfidf": [
                "digital",
                "crypto",
                "house"
            ]
        },
        "timestamp": "2025-03-29T21:08:11.126268+00:00"
    },
    {
        "title": "CoinDesk 20 Performance Update: Index Declines 4.5% as All Assets Trade Lower",
        "link": "https://www.coindesk.com/coindesk-indices/2025/03/28/coindesk-20-performance-update-index-declines-4-5-as-all-assets-trade-lower",
        "published": "Fri, 28 Mar 2025 13:10:04 +0000",
        "summary": "9am CoinDesk 20 Update for 2025-03-28",
        "content": "CoinDesk Indices presents its daily market update, highlighting the performance of leaders and laggards in the CoinDesk 20 Index. The CoinDesk 20 is currently trading at 2616.04, down 4.5% (-123.93) since 4 p.m. ET on Thursday. None of the 20 assets are trading higher. Leaders: BTC (-2.5%) and BCH (-3.6%). Laggards: POL (-8.3%) and SUI (-8.3%). The CoinDesk 20 is a broad-based index traded on multiple platforms in several regions globally. About Contact",
        "analysis": {
            "entities": [
                [
                    "CoinDesk Indices",
                    "ORG"
                ],
                [
                    "daily",
                    "DATE"
                ],
                [
                    "CoinDesk 20",
                    "LAW"
                ],
                [
                    "2616.04",
                    "CARDINAL"
                ],
                [
                    "4.5%",
                    "PERCENT"
                ],
                [
                    "4 p.m. ET",
                    "TIME"
                ],
                [
                    "Thursday",
                    "DATE"
                ],
                [
                    "20",
                    "CARDINAL"
                ],
                [
                    "BCH",
                    "PERSON"
                ],
                [
                    "POL",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.0,
                    "neu": 0.976,
                    "pos": 0.024,
                    "compound": 0.1779
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9999794960021973
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {},
            "crypto_scores": {},
            "topics": [
                [
                    "traded",
                    "presents",
                    "thursday",
                    "update",
                    "index",
                    "leaders",
                    "trading",
                    "laggards",
                    "coindesk",
                    "20"
                ]
            ],
            "top_keywords_tfidf": [
                "coindesk",
                "20",
                "laggards"
            ]
        },
        "timestamp": "2025-03-29T21:08:11.728319+00:00"
    },
    {
        "title": "Grayscale Files for Spot Avalanche ETF on Nasdaq",
        "link": "https://www.coindesk.com/markets/2025/03/28/grayscale-files-for-spot-avalanche-etf-on-nasdaq",
        "published": "Fri, 28 Mar 2025 13:07:07 +0000",
        "summary": "Avalanche",
        "content": "Nasdaq submitted a 19b-4 filing with the U.S. Securities and Exchange Commission (SEC) to approve the listing of a spot Avalanche exchange-traded fund (ETF) managed by Grayscale. Grayscale already manages an Avalanche Trust that carries a 2.5% management fee. The filing could lead to a cheaper, more flexible investment vehicle with exposure to the AVAX token, and reflects an industry trend toward developing regulated vehicles for altcoin trading. The SEC, however, has yet to approve any spot altcoin ETFs beyond those offering exposure to ether (ETH). If approved, Grayscale’s fund would offer another path for traditional investors to access crypto assets through conventional brokerage accounts. The ETF’s custodian would be Coinbase Custody, according tot he filing.  The ETF would hold AVAX directly, tracking the market price of the Avalanche network’s native token. The cryptocurrency is at the time of writing trading at $20.5 after losing 6.6% of its value in the last 24 hours amid a wider market drawdown that has seen the broader CoinDesk 20 Index (CD20) drop by over 4%. Other companies are also looking at Avalanche. Earlier this month, VanEck filed an S-1 form for an Avalanche ETF. Last month, Grayscale also filed for a Cardano ETF, which would become the company’s first standalone ADA investment vehicle. Francisco is a reporter for CoinDesk with a passion for cryptocurrencies and personal finance. Before joining CoinDesk he worked at major financial and crypto publications. He owns bitcoin, ether, solana, and PAXG above CoinDesk's $1,000 disclosure threshold. About Contact",
        "analysis": {
            "entities": [
                [
                    "Nasdaq",
                    "ORG"
                ],
                [
                    "19b-4",
                    "CARDINAL"
                ],
                [
                    "the U.S. Securities and Exchange Commission",
                    "ORG"
                ],
                [
                    "SEC",
                    "ORG"
                ],
                [
                    "Avalanche",
                    "CRYPTO"
                ],
                [
                    "Grayscale",
                    "GPE"
                ],
                [
                    "Avalanche Trust",
                    "ORG"
                ],
                [
                    "2.5%",
                    "PERCENT"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "Grayscale’s",
                    "ORG"
                ],
                [
                    "ETF",
                    "ORG"
                ],
                [
                    "Coinbase Custody",
                    "PERSON"
                ],
                [
                    "20.5",
                    "MONEY"
                ],
                [
                    "6.6%",
                    "PERCENT"
                ],
                [
                    "the last 24 hours",
                    "TIME"
                ],
                [
                    "CoinDesk 20 Index",
                    "LAW"
                ],
                [
                    "over 4%",
                    "PERCENT"
                ],
                [
                    "Earlier this month",
                    "DATE"
                ],
                [
                    "VanEck",
                    "ORG"
                ],
                [
                    "Last month",
                    "DATE"
                ],
                [
                    "ADA",
                    "ORG"
                ],
                [
                    "Francisco",
                    "PERSON"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "solana",
                    "PERSON"
                ],
                [
                    "1,000",
                    "MONEY"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.018,
                    "neu": 0.912,
                    "pos": 0.069,
                    "compound": 0.8977
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9913167953491211
                },
                {
                    "label": "neutral",
                    "score": 0.9999871253967285
                },
                {
                    "label": "neutral",
                    "score": 0.9999523162841797
                },
                {
                    "label": "neutral",
                    "score": 0.999996542930603
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Avalanche": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 5
                }
            },
            "crypto_scores": {
                "Avalanche": 0.7
            },
            "topics": [
                [
                    "exposure",
                    "investment",
                    "trading",
                    "token",
                    "vehicle",
                    "filing",
                    "coindesk",
                    "grayscale",
                    "etf",
                    "avalanche"
                ]
            ],
            "top_keywords_tfidf": [
                "avalanche",
                "etf",
                "grayscale"
            ]
        },
        "timestamp": "2025-03-29T21:08:12.605656+00:00"
    },
    {
        "title": "Galaxy Digital Reaches $200M Settlement Agreement With NYAG Over LUNA Investments",
        "link": "https://www.coindesk.com/markets/2025/03/28/galaxy-digital-reaches-usd200m-settlement-agreement-with-nyag-over-luna-investments",
        "published": "Fri, 28 Mar 2025 12:16:56 +0000",
        "summary": "16:9 crop Mike Novogratz, Founder and CEO, Galaxy Digital (Suzanne Cordiero/Shutterstock/CoinDesk)",
        "content": "Galaxy Digital (GLXY), the Mike Novogratz-led digital asset financial services firm, will pay $200 million as a settlement with the New York Attorney General's (NYAG) office relating to the collapse of the Terra-Luna ecosystem in 2022. The firm will pay $200 million to the State of New York for matters relating to its investment, trading and public statements of LUNA, which collapsed in May 2022, wiping out around $60 billion in value, Galaxy announced on Friday. Galaxy disclosed the settlement as part of its latest earnings statement, which reported profit of $174 million and $365 million for Q4 and the full year of 2024 respectively, when the accrued legal provision for the settlement with NYAG is included. The company has also has entered a 15-year lease agreement with cloud-computing firm CoreWeave, through which it supply 133 MW of electricity for artificial intelligence and high-performance computing at its Helios data center in West Texas. Galaxy expects to generate around $4.5 billion in revenue throughout the lease. The company's profit amount to $1.02 per diluted share.  GLXY shares closed 3.54% lower on Thursday. Jamie has been part of CoinDesk's news team since February 2021, focusing on breaking news, Bitcoin tech and protocols and crypto VC. He holds BTC, ETH and DOGE.  About Contact",
        "analysis": {
            "entities": [
                [
                    "the Mike Novogratz-led",
                    "PERSON"
                ],
                [
                    "$200 million",
                    "MONEY"
                ],
                [
                    "New York",
                    "GPE"
                ],
                [
                    "NYAG",
                    "ORG"
                ],
                [
                    "the Terra-Luna",
                    "ORG"
                ],
                [
                    "2022",
                    "DATE"
                ],
                [
                    "the State of New York",
                    "ORG"
                ],
                [
                    "LUNA",
                    "ORG"
                ],
                [
                    "May 2022",
                    "DATE"
                ],
                [
                    "around $60 billion",
                    "MONEY"
                ],
                [
                    "Friday",
                    "DATE"
                ],
                [
                    "$174 million",
                    "MONEY"
                ],
                [
                    "$365 million",
                    "MONEY"
                ],
                [
                    "Q4",
                    "ORG"
                ],
                [
                    "the full year of 2024",
                    "DATE"
                ],
                [
                    "15-year",
                    "DATE"
                ],
                [
                    "CoreWeave",
                    "ORG"
                ],
                [
                    "133",
                    "CARDINAL"
                ],
                [
                    "MW",
                    "ORG"
                ],
                [
                    "Helios",
                    "CRYPTO"
                ],
                [
                    "West Texas",
                    "GPE"
                ],
                [
                    "around $4.5 billion",
                    "MONEY"
                ],
                [
                    "1.02",
                    "MONEY"
                ],
                [
                    "3.54%",
                    "PERCENT"
                ],
                [
                    "Thursday",
                    "DATE"
                ],
                [
                    "Jamie",
                    "PERSON"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "February 2021",
                    "DATE"
                ],
                [
                    "Bitcoin tech",
                    "PERSON"
                ],
                [
                    "VC",
                    "PERSON"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "DOGE",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.045,
                    "neu": 0.84,
                    "pos": 0.115,
                    "compound": 0.9337
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9985306262969971
                },
                {
                    "label": "neutral",
                    "score": 0.9997318387031555
                },
                {
                    "label": "neutral",
                    "score": 0.9998713731765747
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Helios": {
                    "sentiment": "neutral",
                    "confidence": 0.9999,
                    "mentions": 1
                }
            },
            "crypto_scores": {
                "Helios": 0.3
            },
            "topics": [
                [
                    "news",
                    "pay",
                    "year",
                    "luna",
                    "relating",
                    "profit",
                    "firm",
                    "settlement",
                    "galaxy",
                    "million"
                ]
            ],
            "top_keywords_tfidf": [
                "million",
                "galaxy",
                "settlement"
            ]
        },
        "timestamp": "2025-03-29T21:08:13.254481+00:00"
    },
    {
        "title": "Crypto Daybook Americas: Altcoins Slide, Gold Shines as Trump Tariffs Spur Flight to Safety",
        "link": "https://www.coindesk.com/daybook-us/2025/03/28/crypto-daybook-americas-altcoins-slide-gold-shines-as-trump-tariffs-spur-flight-to-safety",
        "published": "Fri, 28 Mar 2025 11:15:00 +0000",
        "summary": "gold bars",
        "content": "You are viewing Crypto Daybook Americas, your new morning briefing on what happened in the crypto markets overnight and what's expected during the coming day. Crypto Daybook Americas will arrive in your inbox at 7 a.m. ET to kickstart your morning with comprehensive insights. If you're not already subscribed, click here. You won't want to start your day without it. By Francisco Rodrigues (All times ET unless indicated otherwise) The crypto market is extending yesterday's slide as investors anticipate the impact of President Donald Trump’s reciprocal tariffs, set to come into effect on April 2, and key macroeconomic data due later Friday. Bitcoin (BTC) has lost 2.5% in the past 24 hours, which seems pretty staid when compared with an almost 6% in slide in ether (ETH), 5.5% in XRP and 7% in dogecoin (DOGE). The broader CoinDesk 20 Index (CD20) dropped 4.65%. Gold, in contrast, hit new highs. The growing exposure to gold has benefited tokens backed by the precious metal, which CoinDesk Data’s latest stablecoin report shows climbed to a $1.4 billion market capitalization in March. It seems clear traders are moving to reduce risk exposure with one eye on the U.S. personal consumption expenditure (PCE) report set to be released later. That data could influence Federal Reserve interest rate decisions and thus any appetite for risk going forward. Bitcoin traders are also anticipating a record-breaking $12.2 billion in BTC options expiring on Deribit today, with a max pain point at $85,000. Implied volatility, however, remains near annual lows as the expiry isn’t likely to move the market, according to Wintermute OTC trader Jake O. “These expirations are yet to consistently move markets, largely because BTC options open interest remains small relative to spot activity,\" Jake O. said in an emailed statement. \"That $12B is dwarfed by $28B in spot volume traded over the past 24 hours.”  While the derisking trend grows, spot bitcoin exchange-traded funds (ETFs) have seen consistent inflows since mid-March, adding in nearly $1 billion over the past two weeks. In contrast, spot ether ETF outflows have remained persistent, with around $115 million exiting these funds over the same period.  Looking ahead, money managers are likely to keep on reducing risk exposure. The trend spurred Goldman Sachs to raise its gold price target for the year to $3,300 per troy ounce, with the potential to rise to $4,500 in an “extreme tail scenario.” Stay alert! By Shaurya Malwa Spot BTC ETFs: Spot ETH ETFs Source: Farside Investors Francisco is a reporter for CoinDesk with a passion for cryptocurrencies and personal finance. Before joining CoinDesk he worked at major financial and crypto publications. He owns bitcoin, ether, solana, and PAXG above CoinDesk's $1,000 disclosure threshold. Shaurya is the Co-Leader of the CoinDesk tokens and data team in Asia with a focus on crypto derivatives, DeFi, market microstructure, and protocol analysis.\n\nShaurya holds over $1,000 in BTC, ETH, SOL, AVAX, SUSHI, CRV, NEAR, YFI, YFII, SHIB, DOGE, USDT, USDC, BNB, MANA, MLN, LINK, XMR, ALGO, VET, CAKE, AAVE, COMP, ROOK, TRX, SNX, RUNE, FTM, ZIL, KSM, ENJ, CKB, JOE, GHST, PERP, BTRFLY, OHM, BANANA, ROME, BURGER, SPIRIT, and ORCA.\n\nHe provides over $1,000 to liquidity pools on Compound, Curve, SushiSwap, PancakeSwap, BurgerSwap, Orca, AnySwap, SpiritSwap, Rook Protocol, Yearn Finance, Synthetix, Harvest, Redacted Cartel, OlympusDAO, Rome, Trader Joe, and SUN. About Contact",
        "analysis": {
            "entities": [
                [
                    "Crypto Daybook Americas",
                    "ORG"
                ],
                [
                    "the coming day",
                    "DATE"
                ],
                [
                    "7 a.m.",
                    "TIME"
                ],
                [
                    "morning",
                    "TIME"
                ],
                [
                    "Francisco Rodrigues",
                    "PERSON"
                ],
                [
                    "yesterday",
                    "DATE"
                ],
                [
                    "Donald Trump",
                    "PERSON"
                ],
                [
                    "April 2",
                    "DATE"
                ],
                [
                    "later Friday",
                    "DATE"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "2.5%",
                    "PERCENT"
                ],
                [
                    "the past 24 hours",
                    "TIME"
                ],
                [
                    "an almost 6%",
                    "PERCENT"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "5.5%",
                    "PERCENT"
                ],
                [
                    "XRP",
                    "GPE"
                ],
                [
                    "7%",
                    "PERCENT"
                ],
                [
                    "DOGE",
                    "ORG"
                ],
                [
                    "CoinDesk 20 Index",
                    "LAW"
                ],
                [
                    "4.65%",
                    "PERCENT"
                ],
                [
                    "CoinDesk Data’s",
                    "ORG"
                ],
                [
                    "$1.4 billion",
                    "MONEY"
                ],
                [
                    "March",
                    "DATE"
                ],
                [
                    "one",
                    "CARDINAL"
                ],
                [
                    "U.S.",
                    "GPE"
                ],
                [
                    "PCE",
                    "ORG"
                ],
                [
                    "Federal Reserve",
                    "ORG"
                ],
                [
                    "$12.2 billion",
                    "MONEY"
                ],
                [
                    "today",
                    "DATE"
                ],
                [
                    "max",
                    "PERSON"
                ],
                [
                    "85,000",
                    "MONEY"
                ],
                [
                    "annual",
                    "DATE"
                ],
                [
                    "Wintermute",
                    "ORG"
                ],
                [
                    "Jake O.",
                    "PERSON"
                ],
                [
                    "12B",
                    "MONEY"
                ],
                [
                    "28B",
                    "MONEY"
                ],
                [
                    "mid-March",
                    "DATE"
                ],
                [
                    "nearly $1 billion",
                    "MONEY"
                ],
                [
                    "the past two weeks",
                    "DATE"
                ],
                [
                    "ETF",
                    "PRODUCT"
                ],
                [
                    "around $115 million",
                    "MONEY"
                ],
                [
                    "the same period",
                    "DATE"
                ],
                [
                    "Goldman Sachs",
                    "ORG"
                ],
                [
                    "the year",
                    "DATE"
                ],
                [
                    "3,300",
                    "MONEY"
                ],
                [
                    "4,500",
                    "MONEY"
                ],
                [
                    "Shaurya Malwa Spot BTC",
                    "PERSON"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "solana",
                    "PERSON"
                ],
                [
                    "1,000",
                    "MONEY"
                ],
                [
                    "Asia",
                    "CRYPTO"
                ],
                [
                    "DeFi",
                    "ORG"
                ],
                [
                    "over $1,000",
                    "MONEY"
                ],
                [
                    "SOL",
                    "ORG"
                ],
                [
                    "NEAR",
                    "ORG"
                ],
                [
                    "YFI",
                    "ORG"
                ],
                [
                    "YFII",
                    "ORG"
                ],
                [
                    "SHIB",
                    "ORG"
                ],
                [
                    "USDT",
                    "ORG"
                ],
                [
                    "USDC",
                    "ORG"
                ],
                [
                    "BNB",
                    "ORG"
                ],
                [
                    "XMR",
                    "ORG"
                ],
                [
                    "VET",
                    "ORG"
                ],
                [
                    "CAKE",
                    "ORG"
                ],
                [
                    "AAVE",
                    "ORG"
                ],
                [
                    "COMP",
                    "ORG"
                ],
                [
                    "ROOK",
                    "ORG"
                ],
                [
                    "SNX",
                    "ORG"
                ],
                [
                    "RUNE, FTM",
                    "ORG"
                ],
                [
                    "ZIL",
                    "ORG"
                ],
                [
                    "KSM",
                    "ORG"
                ],
                [
                    "ENJ",
                    "ORG"
                ],
                [
                    "CKB",
                    "ORG"
                ],
                [
                    "JOE",
                    "ORG"
                ],
                [
                    "BTRFLY",
                    "ORG"
                ],
                [
                    "OHM",
                    "ORG"
                ],
                [
                    "ROME",
                    "GPE"
                ],
                [
                    "BURGER",
                    "ORG"
                ],
                [
                    "SPIRIT",
                    "ORG"
                ],
                [
                    "ORCA",
                    "ORG"
                ],
                [
                    "Compound",
                    "CRYPTO"
                ],
                [
                    "Curve",
                    "GPE"
                ],
                [
                    "SushiSwap",
                    "ORG"
                ],
                [
                    "PancakeSwap",
                    "ORG"
                ],
                [
                    "BurgerSwap",
                    "ORG"
                ],
                [
                    "Orca",
                    "CRYPTO"
                ],
                [
                    "AnySwap",
                    "GPE"
                ],
                [
                    "SpiritSwap",
                    "ORG"
                ],
                [
                    "Yearn Finance",
                    "PERSON"
                ],
                [
                    "Synthetix",
                    "GPE"
                ],
                [
                    "Harvest",
                    "GPE"
                ],
                [
                    "OlympusDAO",
                    "ORG"
                ],
                [
                    "Rome",
                    "CRYPTO"
                ],
                [
                    "Trader Joe",
                    "PERSON"
                ],
                [
                    "SUN",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.026,
                    "neu": 0.925,
                    "pos": 0.049,
                    "compound": 0.9232
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9999790191650391
                },
                {
                    "label": "negative",
                    "score": 0.9752504825592041
                },
                {
                    "label": "positive",
                    "score": 0.7623639702796936
                },
                {
                    "label": "neutral",
                    "score": 0.997542142868042
                },
                {
                    "label": "positive",
                    "score": 0.9994125366210938
                },
                {
                    "label": "neutral",
                    "score": 0.9999955892562866
                },
                {
                    "label": "neutral",
                    "score": 0.9999996423721313
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Asia": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Compound": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Orca": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Rome": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                }
            },
            "crypto_scores": {
                "Asia": 0.3,
                "Compound": 0.3,
                "Orca": 0.3,
                "Rome": 0.3
            },
            "topics": [
                [
                    "eth",
                    "billion",
                    "market",
                    "bitcoin",
                    "data",
                    "000",
                    "btc",
                    "coindesk",
                    "crypto",
                    "spot"
                ]
            ],
            "top_keywords_tfidf": [
                "crypto",
                "coindesk",
                "spot"
            ]
        },
        "timestamp": "2025-03-29T21:08:15.840946+00:00"
    },
    {
        "title": "French State Bank Bpifrance Plans $27M Investment in Digital Assets",
        "link": "https://www.coindesk.com/business/2025/03/28/french-state-bank-bpifrance-plans-usd27m-investment-in-digital-assets",
        "published": "Fri, 28 Mar 2025 11:07:59 +0000",
        "summary": "16:9 France (Pourya Gohari / Unsplash)",
        "content": "Bpifrance, a French state-owned investment bank, plans to invest 25 million euros ($27 million) in digital assets as part of an initiative to strengthen the country's blockchain industry. The bank will buy and hold crypto tokens related to decentralized finance (DeFi) tokenization, staking and staking, it said on Thursday. The plan is for the investments to support local blockchain projects in their early stages for the betterment of the broader blockchain industry in France \"Having the ability to invest directly in digital assets is a significant step forward for Bpifrance and a pioneering initiative among sovereign wealth funds,\" the bank said. France emerged as a burgeoning crypto hub in 2022 as it sought to pre-empt the introduction of the European Union's Markets in Crypto Assets (MiCA) regulation and tempted a number of prominent cryptocurrency firms to make the country their European base. Jamie has been part of CoinDesk's news team since February 2021, focusing on breaking news, Bitcoin tech and protocols and crypto VC. He holds BTC, ETH and DOGE.  About Contact",
        "analysis": {
            "entities": [
                [
                    "Bpifrance",
                    "ORG"
                ],
                [
                    "French",
                    "NORP"
                ],
                [
                    "25 million",
                    "CARDINAL"
                ],
                [
                    "$27 million",
                    "MONEY"
                ],
                [
                    "DeFi",
                    "ORG"
                ],
                [
                    "Thursday",
                    "DATE"
                ],
                [
                    "France",
                    "GPE"
                ],
                [
                    "2022",
                    "DATE"
                ],
                [
                    "the European Union's Markets",
                    "ORG"
                ],
                [
                    "Crypto Assets (",
                    "GPE"
                ],
                [
                    "European",
                    "NORP"
                ],
                [
                    "Jamie",
                    "PERSON"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "February 2021",
                    "DATE"
                ],
                [
                    "Bitcoin tech",
                    "PERSON"
                ],
                [
                    "VC",
                    "PERSON"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "DOGE",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.0,
                    "neu": 0.882,
                    "pos": 0.118,
                    "compound": 0.9432
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.7058624029159546
                },
                {
                    "label": "neutral",
                    "score": 0.9861409664154053
                },
                {
                    "label": "neutral",
                    "score": 0.9998762607574463
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {},
            "crypto_scores": {},
            "topics": [
                [
                    "invest",
                    "initiative",
                    "news",
                    "million",
                    "staking",
                    "said",
                    "assets",
                    "blockchain",
                    "bank",
                    "crypto"
                ]
            ],
            "top_keywords_tfidf": [
                "crypto",
                "bank",
                "blockchain"
            ]
        },
        "timestamp": "2025-03-29T21:08:16.357605+00:00"
    },
    {
        "title": "Iconic 'Mt. Gox, Where Is Our Money?' Sign Is Up for Auction",
        "link": "https://www.coindesk.com/markets/2025/03/28/iconic-mt-gox-where-is-our-money-sign-is-up-for-auction",
        "published": "Fri, 28 Mar 2025 09:42:12 +0000",
        "summary": "Kolin Burges' famous sign (Kolin Burges)",
        "content": "One cold February morning in 2014, Kolin Burges stood outside Mt. Gox's Tokyo office, clutching a handwritten cardboard sign and demanding answers from the bitcoin exchange's CEO, Mark Karpeles, about his missing crypto. Eleven years later, the iconic sign, emblematic of crypto's first major financial scandal, is being auctioned on Scarce.City with a reserve price of 4.5 BTC ($383,000). The sale starts later Friday and ends April 3. \"At the time, it didn't even cross my mind it could become valuable,\" Burges said in an interview with CoinDesk in Hong Kong. \"I thought maybe I'd write a book someday, but the sign itself never seemed important. It's remarkable how things have evolved.\" Burges had flown from London to Tokyo after Mt. Gox, then the world's largest bitcoin exchange, mysteriously froze withdrawals. \"I woke up one morning and knew I had to go to Tokyo,\" Burges recalled. \"I didn't really have a detailed plan. I just knew I had to be there.\" \"When the withdrawal didn't arrive, I started feeling this growing sense of dread,\" he continued. \"At first, I wasn't 100% sure, but as time went on, it became increasingly clear something was very wrong.\" His impromptu protest quickly gained international media attention, even attracting the notice of mainstream financial press like the Wall Street Journal. Burges recalled those initial days in Tokyo as dreamlike and almost otherworldly. \"The moment I confronted Karpeles was intense,\" he remembered. \"I demanded answers, but he just brushed me off, blaming technical issues. It felt surreal, standing there in the snow, knowing something major was unfolding.\" As Burges protested outside Mt. Gox's offices, the exchange's attempts to mitigate the public fallout became increasingly evident. \"Mt. Gox kept dangling hope, but everyone could see the situation spiraling out of control,\" Burges said. \"They even invited us inside to protest privately. Anything to remove us from public view. It was ridiculous and desperate.\" Burges recalls how over drinks, someone from Mt. Gox, whom he declined to name, privately pressured him to cut it out. \"At one point, Mt. Gox representatives met me secretly, warning that continued protests would cause the exchange to collapse and everyone would lose their bitcoins,\" he said. \"That conversation made it clear they knew more than they admitted, and the situation was far worse than publicly acknowledged.\" Then, Burges recollects, one representative tried paying for their drinks with a Mt. Gox credit card — and it was declined. \"It was an ominous sign their banking relationships were unraveling,\" Burges said. Mt. Gox filed for bankruptcy in February 2014, days after Burges started his protest. Seven years later, Karpeles was found innocent of embezzlement in a Tokyo court, while receiving a suspended sentence for manipulating data.  Last September, Karpeles set up a new crypto exchange, EllipX. He also established a crypto ratings company called Ungox in 2022. In an interview with CoinDesk on the sidelines of Korea Blockchain Week in August 2024, Karples said that if he had modern blockchain analytical tools in 2014, and third-party custodians, Mt. Gox \"wouldn't have happened.\" CORRECT (March 28, 12:53 UTC): Corrects auction site's name to Scarce.city. An earlier version of the story called it Scare.city. Sam Reynolds is a senior reporter based in Asia. Sam was part of the CoinDesk team that won the 2023 Gerald Loeb award in the breaking news category for coverage of FTX's collapse. Prior to CoinDesk, he was a reporter with Blockworks and a semiconductor analyst with IDC.  About Contact",
        "analysis": {
            "entities": [
                [
                    "One",
                    "CRYPTO"
                ],
                [
                    "February morning",
                    "TIME"
                ],
                [
                    "2014",
                    "DATE"
                ],
                [
                    "Kolin Burges",
                    "PERSON"
                ],
                [
                    "Mt. Gox's",
                    "LOC"
                ],
                [
                    "Tokyo",
                    "GPE"
                ],
                [
                    "Mark Karpeles",
                    "PERSON"
                ],
                [
                    "Eleven years later",
                    "DATE"
                ],
                [
                    "first",
                    "ORDINAL"
                ],
                [
                    "Scarce",
                    "GPE"
                ],
                [
                    "4.5",
                    "CARDINAL"
                ],
                [
                    "383,000",
                    "MONEY"
                ],
                [
                    "later Friday",
                    "DATE"
                ],
                [
                    "April 3",
                    "DATE"
                ],
                [
                    "Burges",
                    "ORG"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "Hong Kong",
                    "GPE"
                ],
                [
                    "London",
                    "CRYPTO"
                ],
                [
                    "Mt. Gox",
                    "LOC"
                ],
                [
                    "one morning",
                    "TIME"
                ],
                [
                    "100%",
                    "PERCENT"
                ],
                [
                    "the Wall Street Journal",
                    "ORG"
                ],
                [
                    "those initial days",
                    "DATE"
                ],
                [
                    "Karpeles",
                    "PERSON"
                ],
                [
                    "one",
                    "CARDINAL"
                ],
                [
                    "February 2014, days",
                    "DATE"
                ],
                [
                    "Seven years later",
                    "DATE"
                ],
                [
                    "Last September",
                    "DATE"
                ],
                [
                    "Ungox",
                    "GPE"
                ],
                [
                    "2022",
                    "DATE"
                ],
                [
                    "Korea",
                    "CRYPTO"
                ],
                [
                    "August 2024",
                    "DATE"
                ],
                [
                    "Karples",
                    "PERSON"
                ],
                [
                    "third",
                    "ORDINAL"
                ],
                [
                    "March 28",
                    "DATE"
                ],
                [
                    "UTC",
                    "ORG"
                ],
                [
                    "Sam Reynolds",
                    "PERSON"
                ],
                [
                    "Asia",
                    "CRYPTO"
                ],
                [
                    "Sam",
                    "CRYPTO"
                ],
                [
                    "2023",
                    "DATE"
                ],
                [
                    "Gerald Loeb",
                    "PERSON"
                ],
                [
                    "FTX",
                    "ORG"
                ],
                [
                    "Blockworks",
                    "ORG"
                ],
                [
                    "IDC",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.109,
                    "neu": 0.814,
                    "pos": 0.078,
                    "compound": -0.9316
                },
                "label": "negative"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9998359680175781
                },
                {
                    "label": "neutral",
                    "score": 0.7623817324638367
                },
                {
                    "label": "neutral",
                    "score": 0.8068414330482483
                },
                {
                    "label": "negative",
                    "score": 0.9524306058883667
                },
                {
                    "label": "negative",
                    "score": 0.998630940914154
                },
                {
                    "label": "neutral",
                    "score": 0.9933041930198669
                },
                {
                    "label": "neutral",
                    "score": 0.9999594688415527
                },
                {
                    "label": "neutral",
                    "score": 0.999972939491272
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "One": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "London": {
                    "sentiment": "neutral",
                    "confidence": 0.9999,
                    "mentions": 1
                },
                "Korea": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Asia": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Sam": {
                    "sentiment": "neutral",
                    "confidence": 0.6977,
                    "mentions": 2
                }
            },
            "crypto_scores": {
                "Sam": 0.3395,
                "One": 0.3,
                "London": 0.3,
                "Korea": 0.3,
                "Asia": 0.3
            },
            "topics": [
                [
                    "coindesk",
                    "crypto",
                    "sign",
                    "karpeles",
                    "exchange",
                    "tokyo",
                    "said",
                    "mt",
                    "gox",
                    "burges"
                ]
            ],
            "top_keywords_tfidf": [
                "burges",
                "gox",
                "mt"
            ]
        },
        "timestamp": "2025-03-29T21:08:17.579756+00:00"
    },
    {
        "title": "UK Regulator Intends to Start Authorizing Crypto Firms in 2026",
        "link": "https://www.coindesk.com/policy/2025/03/28/uk-regulator-intends-to-start-authorizing-crypto-firms-in-2026",
        "published": "Fri, 28 Mar 2025 07:30:00 +0000",
        "summary": "null",
        "content": "The U.K.'s crypto industry has just over 12 months to prepare for an even stricter regulatory regime, a senior official with the country's finance regulator said. Matthew Long, director of payments and digital assets at the U.K.'s Financial Conduct Authority (FCA), told CoinDesk in an interview that the \"impending gateway regime\" that is earmarked for 2026 will in fact be a new authorization regime for crypto companies. \"We will have a gateway which will allow authorization. But obviously we've got to go through those consultations, create those rules and get the legislation for that to take place,\" Long said. This regime will be a leap from the current anti-money laundering (AML) one. Firms like crypto exchanges Coinbase, Gemini and Bitpanda will move away from just needing to register with the country to comply with anti-money laundering rules to an authorization regime with rules for a suite of offerings. This will require them to go through a fresh process to secure approval from the FCA. The FCA intends to release papers on stablecoins, trading platforms, staking, prudential crypto exposure and more this year. The regime is expected to go live after final policy papers are published in 2026, Long said. Since its anti-money laundering register for firms opened in 2020, the FCA received 368 applications from firms wishing to comply, but only 50 firms — 14% of applicants — have been approved so far. Many firms may have to start again. Read more: U.K. Financial Regulator Aims for Crypto Regime by 2026 Upcoming legislation will define what counts as a regulated activity, the FCA's Long said. Companies that engage in those activities will need to seek authorization. In 2023 the former U.K. government released papers that said regulated activities would likely include crypto and fiat-referenced stablecoins issuance as well as payment, exchange and lending activities. Stablecoins will no longer be brought under the U.K. payments regulations as set out in previous work, former Economic Secretary Tulip Siddiq said in November. The FCA plans to consult on draft rules for stablecoins early this year. \"What we're doing in terms of the stablecoins is we're making sure that we take the best from the current regulation that exists in TradFi, but stablecoins are ultimately unique,\" Long said. \"There isn't anything that is exactly the same. We've got to adapt the regulation that we've currently got.\" Read more: UK to Draft a Regulatory Framework for Crypto, Stablecoins Early Next Year The FCA is still deciding on the process crypto companies will need to go through to get authorized, Long said. Long added that it was undecided what steps those who are already registered in the money laundering regime will need to take but the new regime will come with wider permissions,\" so we'd expect that if you wanted the further permissions, you'd apply for them.\" Therefore companies may need to go through a lengthy registration process — even if they've already secured an existing license. \"We'll be communicating with firms about what the gateway will look like before it goes live, our intention is to bring it live as soon as humanly possible,\" Long said referring to the authorization regime. In formulating how it intends to move forward, the regulator plans to also look at Europe which has launched bespoke legislation for the crypto sector and the International Organization of Securities Commissions' 18 recommendations. IOSCO will soon be publishing a piece on how countries are progressing with its standards, someone familiar with the matter said. \"It's a case of understanding and looking for best practice,\" Long said. Read more: UK Crypto Firms and Regulator Blame Each Other for Industry Exodus Camomile Shumba is a CoinDesk regulatory reporter based in the UK. Previously, Shumba interned at Business Insider and Bloomberg. Camomile has featured in Harpers Bazaar, Red, the BBC, Black Ballad, Journalism.co.uk, Cryptopolitan.com and South West Londoner.\n\nShumba studied politics, philosophy and economics as a combined degree at the University of East Anglia before doing a postgraduate degree in multimedia journalism. While she did her undergraduate degree she had an award-winning radio show on making a difference. She does not currently hold value in any digital currencies or projects. About Contact",
        "analysis": {
            "entities": [
                [
                    "U.K.",
                    "GPE"
                ],
                [
                    "just over 12 months",
                    "DATE"
                ],
                [
                    "Matthew Long",
                    "PERSON"
                ],
                [
                    "Financial Conduct Authority",
                    "ORG"
                ],
                [
                    "2026",
                    "DATE"
                ],
                [
                    "AML",
                    "ORG"
                ],
                [
                    "Coinbase",
                    "ORG"
                ],
                [
                    "Gemini",
                    "CRYPTO"
                ],
                [
                    "Bitpanda",
                    "ORG"
                ],
                [
                    "FCA",
                    "ORG"
                ],
                [
                    "this year",
                    "DATE"
                ],
                [
                    "2020",
                    "DATE"
                ],
                [
                    "368",
                    "CARDINAL"
                ],
                [
                    "only 50",
                    "CARDINAL"
                ],
                [
                    "14%",
                    "PERCENT"
                ],
                [
                    "2023",
                    "DATE"
                ],
                [
                    "Tulip Siddiq",
                    "PERSON"
                ],
                [
                    "November",
                    "DATE"
                ],
                [
                    "early this year",
                    "DATE"
                ],
                [
                    "TradFi",
                    "GPE"
                ],
                [
                    "UK",
                    "GPE"
                ],
                [
                    "Draft a Regulatory Framework for Crypto, Stablecoins Early Next Year",
                    "ORG"
                ],
                [
                    "Long",
                    "CRYPTO"
                ],
                [
                    "Europe",
                    "LOC"
                ],
                [
                    "the International Organization of Securities Commissions'",
                    "ORG"
                ],
                [
                    "18",
                    "CARDINAL"
                ],
                [
                    "IOSCO",
                    "ORG"
                ],
                [
                    "Crypto Firms",
                    "PERSON"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "Shumba",
                    "PERSON"
                ],
                [
                    "Business Insider",
                    "ORG"
                ],
                [
                    "Bloomberg",
                    "GPE"
                ],
                [
                    "Harpers Bazaar",
                    "GPE"
                ],
                [
                    "Red",
                    "CRYPTO"
                ],
                [
                    "BBC",
                    "ORG"
                ],
                [
                    "Black Ballad",
                    "ORG"
                ],
                [
                    "Journalism.co.uk",
                    "ORG"
                ],
                [
                    "Cryptopolitan.com",
                    "ORG"
                ],
                [
                    "South West Londoner",
                    "GPE"
                ],
                [
                    "the University of East Anglia",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.015,
                    "neu": 0.904,
                    "pos": 0.081,
                    "compound": 0.9928
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9987192153930664
                },
                {
                    "label": "neutral",
                    "score": 0.9996874332427979
                },
                {
                    "label": "neutral",
                    "score": 0.9998276233673096
                },
                {
                    "label": "neutral",
                    "score": 0.9999125003814697
                },
                {
                    "label": "neutral",
                    "score": 0.9999409914016724
                },
                {
                    "label": "neutral",
                    "score": 0.9991641044616699
                },
                {
                    "label": "neutral",
                    "score": 0.999996542930603
                },
                {
                    "label": "neutral",
                    "score": 0.9998420476913452
                },
                {
                    "label": "neutral",
                    "score": 0.9999862909317017
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Gemini": {
                    "sentiment": "neutral",
                    "confidence": 0.9996,
                    "mentions": 1
                },
                "Long": {
                    "sentiment": "neutral",
                    "confidence": 0.9995,
                    "mentions": 9
                },
                "Red": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                }
            },
            "crypto_scores": {
                "Long": 0.6999,
                "Red": 0.3,
                "Gemini": 0.2999
            },
            "topics": [
                [
                    "need",
                    "uk",
                    "authorization",
                    "fca",
                    "stablecoins",
                    "firms",
                    "long",
                    "crypto",
                    "regime",
                    "said"
                ]
            ],
            "top_keywords_tfidf": [
                "said",
                "regime",
                "crypto"
            ]
        },
        "timestamp": "2025-03-29T21:08:18.942499+00:00"
    },
    {
        "title": "Dogecoin, XRP Sink 7% as Trump Tariffs Threats  Dent Markets; Bitcoin Options Expiry Looms",
        "link": "https://www.coindesk.com/markets/2025/03/28/dogecoin-xrp-sink-7-as-tariffs-concerns-dent-markets-bitcoin-options-expiry-looms",
        "published": "Fri, 28 Mar 2025 07:20:53 +0000",
        "summary": "Bull and bear (Shutterstock)",
        "content": "Dogecoin (DOGE), ether (ETH) and xrp (XRP) sank more than 5% in early Asian hours as traders took profits on a relief rally earlier in the week, with eyes on the U.S. personal consumption expenditure (PCE) figures scheduled for release later Friday. Crypto majors tracked by the broad-based CoinDesk 20 (CD20) showed a 4.5% slide on average, led by DOGE at 7%. Toncoin’s TON was the only token in the top-20 by market capitalization in the green with a 5% rise in the past 24 hours. Gold surged to fresh highs Friday with a jump above $3,109 in Asian morning hours, continuing a stellar rise since early March. The MSCI World Index had its longest losing streak in a month, per Bloomberg, while a regional gauge of Asian equities was poised for its biggest drop since Feb. 28. Over $12.2 billion worth of bitcoin (BTC) options will expire with max pain at $85,000 later Friday. “Spot is trading sideways and OI continues to bleed lower, signalling a broad lack of near-term optimism in the market,” traders at Singapore-based QCP Capital said in a Telegram broadcast. “With the PCE Index data due tomorrow, we believe any short-term upside remains capped as markets wait for clarity from Trump's next move in this escalating trade war.” The PCE index captures inflation (or deflation) across a wide range of consumer expenses and reflects changes in consumer behavior. Released monthly, the PCE is said to influence Fed interest rate decisions. High PCE readings signal rising inflation, potentially prompting rate hikes to cool the economy, which can reduce risk appetite and pressure bitcoin prices downward as investors favor safer assets. Conversely, low PCE data suggests tame inflation, possibly leading to rate cuts or steady policy, boosting liquidity and supporting Bitcoin’s price as a speculative asset or inflation hedge. The next release is on March 28 and could sway market sentiment, with bitcoin’s reaction tied to how the data shapes Fed expectations — volatility often follows as traders adjust positions. Markets have been heavy since Thursday as President Donald Trump warned of deeper tariffs on Canada and the European Union in case the two collude and policies impact U.S. economic activity. In turn, Prime Minister Mark Carney of Canada said late Thursday the country would move rapidly to trade more with other countries as the U.S. was “no longer a reliable partner.” “The global market is highly sensitive to monetary policies set by major economies, particularly the United States,” Innokenty Isers, Chief Executive Officer at Paybis, told CoinDesk in a Telegram message. “﻿With its relatively higher volatility, risk-averse investors may favor alternative inflation hedges instead of Bitcoin.” “Considering the longer stretch of the trade war and the potential inflation that will emerge, capital allocation to BTC as a hedge against economic instability might be reduced,” Isers warned. Shaurya is the Co-Leader of the CoinDesk tokens and data team in Asia with a focus on crypto derivatives, DeFi, market microstructure, and protocol analysis.\n\nShaurya holds over $1,000 in BTC, ETH, SOL, AVAX, SUSHI, CRV, NEAR, YFI, YFII, SHIB, DOGE, USDT, USDC, BNB, MANA, MLN, LINK, XMR, ALGO, VET, CAKE, AAVE, COMP, ROOK, TRX, SNX, RUNE, FTM, ZIL, KSM, ENJ, CKB, JOE, GHST, PERP, BTRFLY, OHM, BANANA, ROME, BURGER, SPIRIT, and ORCA.\n\nHe provides over $1,000 to liquidity pools on Compound, Curve, SushiSwap, PancakeSwap, BurgerSwap, Orca, AnySwap, SpiritSwap, Rook Protocol, Yearn Finance, Synthetix, Harvest, Redacted Cartel, OlympusDAO, Rome, Trader Joe, and SUN. About Contact",
        "analysis": {
            "entities": [
                [
                    "DOGE",
                    "ORG"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "xrp (XRP",
                    "ORG"
                ],
                [
                    "more than 5%",
                    "PERCENT"
                ],
                [
                    "early Asian hours",
                    "TIME"
                ],
                [
                    "earlier in the week",
                    "DATE"
                ],
                [
                    "U.S.",
                    "GPE"
                ],
                [
                    "PCE",
                    "ORG"
                ],
                [
                    "later Friday",
                    "DATE"
                ],
                [
                    "CoinDesk 20",
                    "LAW"
                ],
                [
                    "4.5%",
                    "PERCENT"
                ],
                [
                    "7%",
                    "PERCENT"
                ],
                [
                    "Toncoin’s TON",
                    "PERSON"
                ],
                [
                    "5%",
                    "PERCENT"
                ],
                [
                    "the past 24 hours",
                    "TIME"
                ],
                [
                    "Friday",
                    "DATE"
                ],
                [
                    "3,109",
                    "MONEY"
                ],
                [
                    "Asian",
                    "NORP"
                ],
                [
                    "early March",
                    "DATE"
                ],
                [
                    "The MSCI World Index",
                    "ORG"
                ],
                [
                    "a month",
                    "DATE"
                ],
                [
                    "Bloomberg",
                    "GPE"
                ],
                [
                    "Feb. 28",
                    "DATE"
                ],
                [
                    "$12.2 billion",
                    "MONEY"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "max",
                    "PERSON"
                ],
                [
                    "85,000",
                    "MONEY"
                ],
                [
                    "OI",
                    "ORG"
                ],
                [
                    "Singapore",
                    "GPE"
                ],
                [
                    "QCP Capital",
                    "ORG"
                ],
                [
                    "Telegram",
                    "ORG"
                ],
                [
                    "tomorrow",
                    "DATE"
                ],
                [
                    "Trump",
                    "CRYPTO"
                ],
                [
                    "monthly",
                    "DATE"
                ],
                [
                    "Fed",
                    "ORG"
                ],
                [
                    "Bitcoin",
                    "CRYPTO"
                ],
                [
                    "March 28",
                    "DATE"
                ],
                [
                    "Thursday",
                    "DATE"
                ],
                [
                    "Donald Trump",
                    "PERSON"
                ],
                [
                    "Canada",
                    "GPE"
                ],
                [
                    "the European Union",
                    "ORG"
                ],
                [
                    "two",
                    "CARDINAL"
                ],
                [
                    "Mark Carney",
                    "PERSON"
                ],
                [
                    "late Thursday",
                    "DATE"
                ],
                [
                    "the United States",
                    "GPE"
                ],
                [
                    "Innokenty Isers",
                    "PERSON"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "Asia",
                    "CRYPTO"
                ],
                [
                    "DeFi",
                    "ORG"
                ],
                [
                    "over $1,000",
                    "MONEY"
                ],
                [
                    "SOL",
                    "ORG"
                ],
                [
                    "NEAR",
                    "ORG"
                ],
                [
                    "YFI",
                    "ORG"
                ],
                [
                    "YFII",
                    "ORG"
                ],
                [
                    "SHIB",
                    "ORG"
                ],
                [
                    "USDT",
                    "ORG"
                ],
                [
                    "USDC",
                    "ORG"
                ],
                [
                    "BNB",
                    "ORG"
                ],
                [
                    "XMR",
                    "ORG"
                ],
                [
                    "VET",
                    "ORG"
                ],
                [
                    "CAKE",
                    "ORG"
                ],
                [
                    "AAVE",
                    "ORG"
                ],
                [
                    "COMP",
                    "ORG"
                ],
                [
                    "ROOK",
                    "ORG"
                ],
                [
                    "SNX",
                    "ORG"
                ],
                [
                    "RUNE, FTM",
                    "ORG"
                ],
                [
                    "ZIL",
                    "ORG"
                ],
                [
                    "KSM",
                    "ORG"
                ],
                [
                    "ENJ",
                    "ORG"
                ],
                [
                    "CKB",
                    "ORG"
                ],
                [
                    "JOE",
                    "ORG"
                ],
                [
                    "BTRFLY",
                    "ORG"
                ],
                [
                    "OHM",
                    "ORG"
                ],
                [
                    "ROME",
                    "GPE"
                ],
                [
                    "BURGER",
                    "ORG"
                ],
                [
                    "SPIRIT",
                    "ORG"
                ],
                [
                    "ORCA",
                    "ORG"
                ],
                [
                    "Compound",
                    "CRYPTO"
                ],
                [
                    "Curve",
                    "GPE"
                ],
                [
                    "SushiSwap",
                    "ORG"
                ],
                [
                    "PancakeSwap",
                    "ORG"
                ],
                [
                    "BurgerSwap",
                    "ORG"
                ],
                [
                    "Orca",
                    "CRYPTO"
                ],
                [
                    "AnySwap",
                    "GPE"
                ],
                [
                    "SpiritSwap",
                    "ORG"
                ],
                [
                    "Yearn Finance",
                    "PERSON"
                ],
                [
                    "Synthetix",
                    "GPE"
                ],
                [
                    "Harvest",
                    "GPE"
                ],
                [
                    "OlympusDAO",
                    "ORG"
                ],
                [
                    "Rome",
                    "CRYPTO"
                ],
                [
                    "Trader Joe",
                    "PERSON"
                ],
                [
                    "SUN",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.048,
                    "neu": 0.872,
                    "pos": 0.08,
                    "compound": 0.9525
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "positive",
                    "score": 0.987436056137085
                },
                {
                    "label": "negative",
                    "score": 0.9945164322853088
                },
                {
                    "label": "neutral",
                    "score": 0.9993070363998413
                },
                {
                    "label": "negative",
                    "score": 0.9822121262550354
                },
                {
                    "label": "neutral",
                    "score": 0.9182803630828857
                },
                {
                    "label": "neutral",
                    "score": 0.9478821158409119
                },
                {
                    "label": "neutral",
                    "score": 0.9999998807907104
                },
                {
                    "label": "neutral",
                    "score": 0.9999879598617554
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Trump": {
                    "sentiment": "negative",
                    "confidence": 0.9999,
                    "mentions": 2
                },
                "Bitcoin": {
                    "sentiment": "positive",
                    "confidence": 0.5637,
                    "mentions": 2
                },
                "Asia": {
                    "sentiment": "positive",
                    "confidence": 0.9844,
                    "mentions": 4
                },
                "Compound": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Orca": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Rome": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                }
            },
            "crypto_scores": {
                "Asia": 1.3844,
                "Bitcoin": 0.7637,
                "Compound": 0.3,
                "Orca": 0.3,
                "Rome": 0.3,
                "Trump": -0.7999
            },
            "topics": [
                [
                    "index",
                    "hours",
                    "coindesk",
                    "traders",
                    "btc",
                    "data",
                    "bitcoin",
                    "market",
                    "pce",
                    "inflation"
                ]
            ],
            "top_keywords_tfidf": [
                "inflation",
                "pce",
                "market"
            ]
        },
        "timestamp": "2025-03-29T21:08:20.447625+00:00"
    },
    {
        "title": "GameStop Prices Bitcoin Notes at $29.85",
        "link": "https://www.coindesk.com/markets/2025/03/28/gamestop-gme-prices-bitcoin-senior-notes-at-usd29-85",
        "published": "Fri, 28 Mar 2025 03:41:21 +0000",
        "summary": "A GameStop store (CoinDesk Archive)",
        "content": "GameStop (GME) has priced its previously announced private offering of $1.3 billion in convertible senior notes, setting the stage for the company's foray into having bitcoin (BTC) on its balance sheet. The zero-coupon notes, due in 2030, will initially convert at a rate of 33.4970 shares per $1,000, representing an initial conversion price of approximately $29.85 per share. GameStop (GME) closed at $22.09 at the end of the Thursday trading day in New York, putting the bitcoin notes at an approximately 35% premium over its most recent closing price. Since announcing its BTC bond strategy, GME's stock is down – over 22% during Thursday's trading day – as investors approach this with skepticism despite CEO Ryan Cohen positioning this strategic shift toward bitcoin as a means to leverage the company’s sizeable cash reserves Should the sale be successful and hit its targets, GME would be the fourth largest corporate holder of BTC, behind miner behind Riot Platforms (RIOT) and ahead of Tesla (TSLA). Sam Reynolds is a senior reporter based in Asia. Sam was part of the CoinDesk team that won the 2023 Gerald Loeb award in the breaking news category for coverage of FTX's collapse. Prior to CoinDesk, he was a reporter with Blockworks and a semiconductor analyst with IDC.  About Contact",
        "analysis": {
            "entities": [
                [
                    "GME",
                    "ORG"
                ],
                [
                    "$1.3 billion",
                    "MONEY"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "zero",
                    "CARDINAL"
                ],
                [
                    "2030",
                    "DATE"
                ],
                [
                    "33.4970",
                    "CARDINAL"
                ],
                [
                    "1,000",
                    "MONEY"
                ],
                [
                    "approximately $29.85",
                    "MONEY"
                ],
                [
                    "22.09",
                    "MONEY"
                ],
                [
                    "the end of the Thursday trading day",
                    "DATE"
                ],
                [
                    "New York",
                    "GPE"
                ],
                [
                    "22%",
                    "PERCENT"
                ],
                [
                    "Thursday",
                    "DATE"
                ],
                [
                    "Ryan Cohen",
                    "PERSON"
                ],
                [
                    "fourth",
                    "ORDINAL"
                ],
                [
                    "Riot Platforms",
                    "ORG"
                ],
                [
                    "Tesla",
                    "PERSON"
                ],
                [
                    "Sam Reynolds",
                    "PERSON"
                ],
                [
                    "Asia",
                    "CRYPTO"
                ],
                [
                    "Sam",
                    "CRYPTO"
                ],
                [
                    "2023",
                    "DATE"
                ],
                [
                    "Gerald Loeb",
                    "PERSON"
                ],
                [
                    "FTX",
                    "ORG"
                ],
                [
                    "Blockworks",
                    "ORG"
                ],
                [
                    "IDC",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.04,
                    "neu": 0.891,
                    "pos": 0.069,
                    "compound": 0.765
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9992881417274475
                },
                {
                    "label": "negative",
                    "score": 0.8245442509651184
                },
                {
                    "label": "neutral",
                    "score": 0.9999788999557495
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Asia": {
                    "sentiment": "neutral",
                    "confidence": 1.0,
                    "mentions": 1
                },
                "Sam": {
                    "sentiment": "neutral",
                    "confidence": 0.6977,
                    "mentions": 2
                }
            },
            "crypto_scores": {
                "Sam": 0.3395,
                "Asia": 0.3
            },
            "topics": [
                [
                    "gamestop",
                    "company",
                    "price",
                    "reporter",
                    "riot",
                    "thursday",
                    "notes",
                    "bitcoin",
                    "btc",
                    "gme"
                ]
            ],
            "top_keywords_tfidf": [
                "gme",
                "btc",
                "bitcoin"
            ]
        },
        "timestamp": "2025-03-29T21:08:21.276308+00:00"
    },
    {
        "title": "CoreWeave Goes Public at $40 Per Share, Raises $1.5 Billion",
        "link": "https://www.coindesk.com/markets/2025/03/27/coreweave-goes-public-at-usd40-per-share-raises-usd1-5-billion",
        "published": "Fri, 28 Mar 2025 00:08:05 +0000",
        "summary": "Cloud computing firm CoreWeave IPOs at $40 per share. (CoinDesk archives)",
        "content": "Artificial intelligence-focused firm CoreWeave raised $1.5 billion for its initial public offering (IPO), valuing the company at roughly $23 billion, Bloomberg reported on Thursday night, confirming earlier reports that it had downsized its IPO. The cloud provider sold 37.5 million shares at $40 each. It had initially planned to sell 49 million shares at $47 to $55 each, but a weaker-than-expected stock market posed difficulties for the company. The company initially sought to raise $4 billion at a $35 billion valuation, reporting $1.9 billion in revenue last year but still seeing a net loss of nearly $900 million. AI powerhouse Nvidia, an investor in CoreWeave, is anchoring the IPO with a $250 million order, Bloomberg reported, citing a person familiar with the matter. CoreWeave is closely tied to bitcoin miner CoreScientific, which struck a multi-billion deal with the New Jersey-based firm to expand its artificial intelligence capabilities. Nvidia's own stock price is down 12% since the beginning of the year, The Information reported late Thursday, reflecting broader weakness in AI-focused firms. UPDATE (March 28, 2025, 00:20 UTC): Adds additional detail. Helene is a New York-based news reporter at CoinDesk, covering news about Wall Street, the rise of the spot bitcoin exchange-traded funds (ETFs) and updates on crypto exchanges. She is also the co-host of CoinDesk's Markets Daily show on Spotify and Youtube. Helene is a recent graduate of New York University's business and economic reporting program and has appeared on CBS News, YahooFinance and Nasdaq TradeTalks. She holds BTC and ETH. About Contact",
        "analysis": {
            "entities": [
                [
                    "CoreWeave",
                    "ORG"
                ],
                [
                    "$1.5 billion",
                    "MONEY"
                ],
                [
                    "IPO",
                    "ORG"
                ],
                [
                    "roughly $23 billion",
                    "MONEY"
                ],
                [
                    "Bloomberg",
                    "GPE"
                ],
                [
                    "Thursday",
                    "DATE"
                ],
                [
                    "night",
                    "TIME"
                ],
                [
                    "37.5 million",
                    "CARDINAL"
                ],
                [
                    "40",
                    "MONEY"
                ],
                [
                    "49 million",
                    "CARDINAL"
                ],
                [
                    "$47 to $55",
                    "MONEY"
                ],
                [
                    "$4 billion",
                    "MONEY"
                ],
                [
                    "$35 billion",
                    "MONEY"
                ],
                [
                    "$1.9 billion",
                    "MONEY"
                ],
                [
                    "last year",
                    "DATE"
                ],
                [
                    "nearly $900 million",
                    "MONEY"
                ],
                [
                    "Nvidia",
                    "GPE"
                ],
                [
                    "$250 million",
                    "MONEY"
                ],
                [
                    "CoreScientific",
                    "ORG"
                ],
                [
                    "multi-billion",
                    "MONEY"
                ],
                [
                    "New Jersey",
                    "GPE"
                ],
                [
                    "12%",
                    "PERCENT"
                ],
                [
                    "the beginning of the year",
                    "DATE"
                ],
                [
                    "late Thursday",
                    "DATE"
                ],
                [
                    "AI",
                    "GPE"
                ],
                [
                    "March 28, 2025",
                    "DATE"
                ],
                [
                    "00:20 UTC",
                    "TIME"
                ],
                [
                    "New York",
                    "GPE"
                ],
                [
                    "CoinDesk's Markets Daily",
                    "ORG"
                ],
                [
                    "Spotify",
                    "GPE"
                ],
                [
                    "Youtube",
                    "GPE"
                ],
                [
                    "New York University's",
                    "ORG"
                ],
                [
                    "CBS News",
                    "ORG"
                ],
                [
                    "YahooFinance",
                    "ORG"
                ],
                [
                    "Nasdaq TradeTalks",
                    "ORG"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.046,
                    "neu": 0.903,
                    "pos": 0.051,
                    "compound": -0.2023
                },
                "label": "negative"
            },
            "bert_sentiment": [
                {
                    "label": "negative",
                    "score": 0.9997809529304504
                },
                {
                    "label": "negative",
                    "score": 0.9799527525901794
                },
                {
                    "label": "neutral",
                    "score": 0.9999940395355225
                },
                {
                    "label": "neutral",
                    "score": 0.9999821186065674
                }
            ],
            "bert_sentiment_summary": "negative",
            "entity_sentiment": {},
            "crypto_scores": {},
            "topics": [
                [
                    "york",
                    "helene",
                    "ipo",
                    "company",
                    "coreweave",
                    "new",
                    "reported",
                    "news",
                    "million",
                    "billion"
                ]
            ],
            "top_keywords_tfidf": [
                "billion",
                "million",
                "news"
            ]
        },
        "timestamp": "2025-03-29T21:08:22.051057+00:00"
    },
    {
        "title": "Sei Foundation Explores Buying 23andMe to Put Genetic Data on Blockchain",
        "link": "https://www.coindesk.com/business/2025/03/27/sei-foundation-explores-buying-23andme-to-put-genetic-data-on-blockchain",
        "published": "Thu, 27 Mar 2025 20:25:24 +0000",
        "summary": "23andMe advertisement (John Murphy/Flickr)",
        "content": "The Sei Foundation, the nonprofit development organization behind the layer-1 blockchain Sei (SEI), is exploring the acquisition of bankrupt personal genomics company 23andMe and putting the genetic data of 15 million users on blockchain rails.  The foundation announced the initiative in an X post on Thursday, calling the plan its \"boldest DeSci bet yet\" — referring to the decentralized science movement. Earlier this year, it also launched a $65 million venture capital fund dedicated to DeSci startups building on the Sei network. The foundation said that genomic data security is a national security matter, particularly as 23andMe grapples with financial difficulties. The company, known for its direct-to-consumer DNA testing services, filed for Chapter 11 bankruptcy protection earlier this week. If the acquisition proceeds, the Sei Fundation plans to integrate 23andMe's data onto its blockchain and give users ownership of their genetic data, ensuring privacy through encrypted transfers and allowing individuals to decide how their data is monetized. \"This isn't just about saving a company, it's about building a future where your most personal data remains yours to control,\" the foundation said. Numerous state attorneys general have warned 23andme customers to delete their data from the platform in recent days since the company's bankruptcy filing. SEI, the native token of the network, climbed as much as 3% following the news before giving back some of the gains. Krisztian Sandor is a U.S. markets reporter focusing on stablecoins, tokenization, real-world assets. He graduated from New York University's business and economic reporting program before joining CoinDesk. He holds BTC, SOL and ETH.\n About Contact",
        "analysis": {
            "entities": [
                [
                    "The Sei Foundation",
                    "ORG"
                ],
                [
                    "Sei (SEI",
                    "ORG"
                ],
                [
                    "23andMe",
                    "CARDINAL"
                ],
                [
                    "15 million",
                    "CARDINAL"
                ],
                [
                    "Thursday",
                    "DATE"
                ],
                [
                    "DeSci",
                    "PERSON"
                ],
                [
                    "Earlier this year",
                    "DATE"
                ],
                [
                    "$65 million",
                    "MONEY"
                ],
                [
                    "Sei",
                    "CRYPTO"
                ],
                [
                    "Chapter 11",
                    "LAW"
                ],
                [
                    "earlier this week",
                    "DATE"
                ],
                [
                    "the Sei Fundation",
                    "ORG"
                ],
                [
                    "23andme",
                    "CARDINAL"
                ],
                [
                    "recent days",
                    "DATE"
                ],
                [
                    "SEI",
                    "ORG"
                ],
                [
                    "as much as 3%",
                    "PERCENT"
                ],
                [
                    "Krisztian Sandor",
                    "PERSON"
                ],
                [
                    "U.S.",
                    "GPE"
                ],
                [
                    "New York University's",
                    "ORG"
                ],
                [
                    "CoinDesk",
                    "PRODUCT"
                ],
                [
                    "BTC",
                    "ORG"
                ],
                [
                    "SOL",
                    "ORG"
                ],
                [
                    "ETH",
                    "ORG"
                ],
                [
                    "Contact",
                    "GPE"
                ]
            ],
            "vader_sentiment": {
                "scores": {
                    "neg": 0.029,
                    "neu": 0.891,
                    "pos": 0.08,
                    "compound": 0.8658
                },
                "label": "positive"
            },
            "bert_sentiment": [
                {
                    "label": "neutral",
                    "score": 0.9989308714866638
                },
                {
                    "label": "negative",
                    "score": 0.7661349773406982
                },
                {
                    "label": "positive",
                    "score": 0.727928876876831
                },
                {
                    "label": "neutral",
                    "score": 0.9999903440475464
                }
            ],
            "bert_sentiment_summary": "neutral",
            "entity_sentiment": {
                "Sei": {
                    "sentiment": "neutral",
                    "confidence": 0.9378,
                    "mentions": 3
                }
            },
            "crypto_scores": {
                "Sei": 0.4876
            },
            "topics": [
                [
                    "earlier",
                    "desci",
                    "users",
                    "security",
                    "blockchain",
                    "23andme",
                    "company",
                    "foundation",
                    "sei",
                    "data"
                ]
            ],
            "top_keywords_tfidf": [
                "data",
                "sei",
                "foundation"
            ]
        },
        "timestamp": "2025-03-29T21:08:22.802265+00:00"
    }
]